{"indicators": {"2022-12-22": {"symbol": "LTIM", "datetime": "2022-12-22", "close": 4338.9990234375, "high": 4433.637462797619, "low": 4310.756138392858, "open": 4403.908110119048, "volume": 334180, "change_in_price": -45.33740234375, "down_days": 45.33740234375, "up_days": 0.0, "RSI": 37.49980397281673, "low_14": 4190.897214331317, "high_14": 5061.670758101946, "k_percent": 17.008074046998694, "r_percent": -82.9919259530013, "MACD": -122.28863142004957, "MACD_EMA": -109.0943542022902, "Price_Rate_Of_Change": -0.005282053744703807, "On Balance Volume": -3976399, "sentiment": -0.25, "2_class_prediction": -1.0, "4_class_prediction": -1.0}, "2022-12-26": {"symbol": "LTIM", "datetime": "2022-12-26", "close": 4309.7158203125, "high": 4315.166201656776, "low": 4204.325167907481, "open": 4222.559074174914, "volume": 248624, "change_in_price": 81.65673828125, "down_days": 0.0, "up_days": 81.65673828125, "RSI": 40.36340422543177, "low_14": 4186.884119331272, "high_14": 4771.9573956324775, "k_percent": 20.994242252485353, "r_percent": -79.00575774751465, "MACD": -123.4432964202324, "MACD_EMA": -114.87626597623702, "Price_Rate_Of_Change": 0.007214360068459991, "On Balance Volume": -4157634, "sentiment": -1.0, "2_class_prediction": -1.0, "4_class_prediction": -1.0}, "2022-12-27": {"symbol": "LTIM", "datetime": "2022-12-27", "close": 4350.841796875, "high": 4375.764809649713, "low": 4316.2562597424685, "open": 4331.2699712840795, "volume": 245105, "change_in_price": 41.1259765625, "down_days": 0.0, "up_days": 41.1259765625, "RSI": 45.3231420513685, "low_14": 4186.884119331272, "high_14": 4656.459185497879, "k_percent": 34.916180469760135, "r_percent": -65.08381953023986, "MACD": -115.82957748048284, "MACD_EMA": -115.06693658196235, "Price_Rate_Of_Change": -0.011860853792950321, "On Balance Volume": -3912529, "sentiment": 2.0, "2_class_prediction": 1.0, "4_class_prediction": 1.0}, "2022-12-28": {"symbol": "LTIM", "datetime": "2022-12-28", "close": 4292.91845703125, "high": 4355.350096641815, "low": 4267.3514076935835, "open": 4327.602701259341, "volume": 312640, "change_in_price": -57.92333984375, "down_days": 57.92333984375, "up_days": 0.0, "RSI": 39.92684172641354, "low_14": 4186.884119331272, "high_14": 4564.496261921991, "k_percent": 28.08022458507246, "r_percent": -71.91977541492753, "MACD": -113.0381534850867, "MACD_EMA": -114.66116582353989, "Price_Rate_Of_Change": 0.00016153844666222383, "On Balance Volume": -4225169, "sentiment": -1.0, "2_class_prediction": -1.0, "4_class_prediction": -1.0}, "2022-12-29": {"symbol": "LTIM", "datetime": "2022-12-29", "close": 4380.3232421875, "high": 4414.809099515386, "low": 4241.387866650023, "open": 4268.2434800575575, "volume": 1092863, "change_in_price": 87.40478515625, "down_days": 0.0, "up_days": 87.40478515625, "RSI": 50.24185526071386, "low_14": 4186.884119331272, "high_14": 4433.637462797619, "k_percent": 78.39371906326758, "r_percent": -21.606280936732414, "MACD": -102.75968912485314, "MACD_EMA": -112.280804129003, "Price_Rate_Of_Change": 0.019336586549791424, "On Balance Volume": -3132306, "sentiment": 0.0, "2_class_prediction": -1.0, "4_class_prediction": -1.0}, "2022-12-30": {"symbol": "LTIM", "datetime": "2022-12-30", "close": 4326.017578125, "high": 4429.624673763157, "low": 4314.869069662402, "open": 4390.034887938813, "volume": 317547, "change_in_price": -54.3056640625, "down_days": 54.3056640625, "up_days": 0.0, "RSI": 44.73510225734058, "low_14": 4186.884119331272, "high_14": 4433.637462797619, "k_percent": 56.38564277963, "r_percent": -43.61435722037, "MACD": -97.76680639529422, "MACD_EMA": -109.37793984622454, "Price_Rate_Of_Change": -0.0016465531463002447, "On Balance Volume": -3449853, "sentiment": -0.67, "2_class_prediction": -1.0, "4_class_prediction": -1.0}, "2023-01-02": {"symbol": "LTIM", "datetime": "2023-01-02", "close": 4283.10791015625, "high": 4346.282784199664, "low": 4255.955198323022, "open": 4326.017082034481, "volume": 268574, "change_in_price": -42.90966796875, "down_days": 42.90966796875, "up_days": 0.0, "RSI": 40.670931210972995, "low_14": 4186.884119331272, "high_14": 4433.637462797619, "k_percent": 38.99594205016365, "r_percent": -61.004057949836344, "MACD": -96.08833316052096, "MACD_EMA": -106.71997108933664, "Price_Rate_Of_Change": -0.009192619744139652, "On Balance Volume": -3718427, "sentiment": 2.0, "2_class_prediction": -1.0, "4_class_prediction": -1.0}}, "dates": ["2022-12-22", "2022-12-26", "2022-12-27", "2022-12-28", "2022-12-29", "2022-12-30", "2023-01-02"], "articles": {"2023-01-02": [{"_id": {"$oid": "63e9d85fcf226a5bfd62d552"}, "url": "https://www.livemint.com/market/commodities/jefferies-is-cautious-on-indian-it-sector-infosys-stock-is-its-only-buy-pick-11672632313797.html", "title": "Jefferies is cautious on Indian IT sector. This stock is its only 'Buy' pick", "datetime": "2023-01-02 12:26", "content": " During Q3 FY23, global brokerage Jefferies expects aggregate revenues for its Indian IT coverage to moderate sharply to 1.4% sequentially (QoQcc), with HCL Technologies and LTIMindtree leading growth. Margins for other IT firms are likely to be steady QoQ as slower growth will offset benefits of improving pyramid and easing attrition, it said. \"We expect aggregate margins to rise by 50bps QoQ led by improving pyramid, utilization and easing wage pressures. Expect Coforge and HCLT to witness the highest margin expansion. Focus will be on demand outlook, nature of deals, pricing and attrition trends,\" the note stated. Jefferies remains cautious on the Indian IT sector with Infosys its only stock pick. Accenture's recent results indicated rising caution with shift in client focus towards cost optimization projects vs. growth projects. Amidst macro uncertainty, focus will be on management commentary on the demand environment. \"Commentary around deal pipeline, sales cycle, nature of deals and deal tenure, pricing, and vendor consolidation will be keenly watched. Furthermore, there will be a strong focus on commentary around client budgets or re-prioritization of client spends. While revisions to FY23 guidance of Infosys, HCL Tech, and Coforge will also be closely watched, we don't expect this to be revised in 3Q,\" the brokerage highlighted. Accenture's implied revenue growth guidance of 5.6-9.6% YoYcc in 2HFY23 vs. 25% YoYcc in 2HFY22 implies sharp moderation in revenue growth for Indian IT in FY24. Given this, Jefferies believes risk/reward is unfavorable as IT stocks still trade near +1 standard deviation above their 10-year average and 15% premium to Nifty, and has maintained its cautious stance with Infosys its only BUY (target price of ₹1,710). \"We expect 3QFY23 revenue growth to be soft at 0.6% QoQcc due to higher than expected furloughs. Ebit margins will likely be flattish QoQ due to limited operating leverage due to muted growth. Expect large deal bookings to be in the range of $2bn - $2.5bn. We expect Infosys to retain its 15-16% YoYcc revenue growth guidance and 21-22% margin guidance for FY23,\" said Jefferies. The views and recommendations made above are those of individual analysts or broking companies, and not of Mint.", "date": "2023-01-02", "resolved_text": " During Q3 FY23, global brokerage Jefferies expects aggregate revenues for global brokerage Jefferies's Indian IT coverage to moderate sharply to 1.4% sequentially (QoQcc), with HCL Technologies and LTIMindtree leading growth. Margins for other IT firms are likely to be steady QoQ as slower growth will offset benefits of improving pyramid and easing attrition, global brokerage Jefferies said. \"global brokerage Jefferies expect aggregate margins to rise by 50bps QoQ led by improving pyramid, utilization and easing wage pressures. Expect Coforge and HCL Technologies to witness the highest margin expansion. Focus will be on demand outlook, nature of deals, pricing and attrition trends,\" the note stated. global brokerage Jefferies remains cautious on the Indian IT sector with Infosys global brokerage Jefferies's only stock pick. Accenture's's recent results indicated rising caution with shift in client focus towards cost optimization projects vs. growth projects. Amidst macro uncertainty, focus will be on management commentary on the demand environment. \"Commentary around deal pipeline, sales cycle, nature of deals and deal tenure, pricing, and vendor consolidation will be keenly watched. Furthermore, there will be a strong focus on commentary around client budgets or re-prioritization of client spends. While revisions to Q3 FY23 guidance of Infosys, HCL Technologies, and Coforge will also be closely watched, global brokerage Jefferies don't expect revisions to FY23 guidance of Infosys, HCL Tech, and Coforge to be revised in Q3 FY23,\" global brokerage Jefferies highlighted. Accenture's's implied revenue growth guidance of 5.6-9.6% YoYcc in 2HFY23 vs. 25% YoYcc in 2HFY22 implies sharp moderation in revenue growth for Indian IT in FY24. Given this, global brokerage Jefferies believes risk/reward is unfavorable as IT stocks still trade near +1 standard deviation above IT stocks's 10-year average and 15% premium to Nifty, and has maintained global brokerage Jefferies's cautious stance with Infosys Infosys's only BUY (target price of ₹1,710). \"global brokerage Jefferies expect Q3 FY23 revenue growth to be soft at 0.6% QoQcc due to higher than expected furloughs. Ebit margins will likely be flattish QoQ due to limited operating leverage due to muted growth. Expect large deal bookings to be in the range of $2bn - $2.5bn. global brokerage Jefferies expect Infosys to retain Infosys's 15-16% YoYcc revenue growth guidance and 21-22% margin guidance for Q3 FY23,\" said global brokerage Jefferies. The views and recommendations made above are those of individual analysts or broking companies, and not of Mint.", "sentiment_score": 1.0, "sentiment_class": "Positive", "sentiment_class_value": 2}], "2022-12-30": [{"_id": {"$oid": "63af18d637c41e98a353f1c6"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-nifty-it-index-falls-0-23/articleshow/96622168.cms", "title": "Stock market update: Nifty IT index falls 0.23%", "datetime": "2022-12-30 16:36", "content": "NEW DELHI: The Nifty IT index closed on a negative note on Friday. Shares of MPhasis(up 2.13 per cent), Persistent Systems(up 1.13 per cent), L&T Technology(up 0.66 per cent), Wipro(up 0.51 per cent) and Tech Mahindra(up 0.32 per cent) ended the day as top gainers in the pack. On the other hand, LTIMindtree Ltd(down 1.24 per cent), Coforge(down 0.8 per cent), Infosys(down 0.62 per cent), HCL Technologies(down 0.49 per cent) and Tata Consultancy(down 0.37 per cent) finished as the top losers of the day. The Nifty IT index closed 0.23 per cent down at 28621.7. Benchmark NSE Nifty50 index ended down 85.7 points at 18105.3, while the BSE Sensex stood down 293.14 points at 60840.74. Among the 50 stocks in the Nifty index, 19 ended in the green, while 31 closed in the red. Shares of , , , PNB and IOB were among the most traded shares on the NSE. Shares of , Pritika Engineering Components Ltd., , Baheti Recycling Industries Ltd. and hit their fresh 52-week highs in today's trade, while Elin Electronics Ltd., KFIN Technologies Ltd., Inds., and P&G Health hit their fresh 52-week lows. ", "date": "2022-12-30", "resolved_text": "NEW DELHI: The Nifty IT index closed on a negative note on Friday. Shares of MPhasis(up 2.13 per cent), Persistent Systems(up 1.13 per cent), L&T Technology(up 0.66 per cent), Wipro(up 0.51 per cent) and Tech Mahindra(up 0.32 per cent) ended Friday as top gainers in the pack. On the other hand, LTIMindtree Ltd(down 1.24 per cent), Coforge(down 0.8 per cent), Infosys(down 0.62 per cent), HCL Technologies(down 0.49 per cent) and Tata Consultancy(down 0.37 per cent) finished as the top losers of Friday. The Nifty IT index closed 0.23 per cent down at 28621.7. Benchmark NSE Nifty50 index ended down 85.7 points at 18105.3, while the BSE Sensex stood down 293.14 points at 60840.74. Among the 50 stocks in The Nifty IT index, 19 ended in the green, while 31 closed in the red. Shares of , , , PNB and IOB were among the most traded shares on NSE. Shares of , Pritika Engineering Components Ltd., , Baheti Recycling Industries Ltd. and hit Shares of , Pritika Engineering Components Ltd., , Baheti Recycling Industries Ltd. and's fresh 52-week highs in Friday's trade, while Elin Electronics Ltd., KFIN Technologies Ltd., Inds., and P&G Health hit Elin Electronics Ltd., KFIN Technologies Ltd., Inds., and P&G Health's fresh 52-week lows. ", "sentiment_score": 0.0, "sentiment_class": "Neutral", "sentiment_class_value": 0}, {"_id": {"$oid": "63af190737c41e98a353f23a"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/lt-infotech-shares-down-0-64-as-nifty-drops/articleshow/96617068.cms", "title": "L&T Infotech shares down 0.64% as Nifty drops ", "datetime": "2022-12-30 13:17", "content": "NEW DELHI: Shares of LTIMindtree Ltd. traded 0.64 per cent down in Friday's trade at 01:17PM (IST). Around 7,140 shares changed hands on the counter. The counter opened at Rs 4421.05 and touched an intraday high and low of Rs 4471.05 and Rs 4392.0, respectively, in the session so far. The stock of LTIMindtree Ltd. quoted a 52-week high of Rs 7595.25 and a 52-week low of Rs 3733.25. As per BSE , the total market cap of the LTIMindtree Ltd. stood at Rs 130150.22 crore at the time of writing this report. The company reported consolidated sales of Rs 4976.0 crore for the quarter ended 30-Sep-2022, up 6.62 per cent from previous quarter's Rs 4666.9 crore and up 28.31 per cent from the year-ago quarter's Rs 3878.2 crore. The net profit for latest quarter stood at Rs 679.3 crore, up 23.17 per cent from the same quarter a year ago. As of 30-Sep-2022, domestic institutional investors held 5.09 per cent stake in the firm, while foreign institutional investors held 8.42 per cent and the promoters 74.03 per cent. According to BSE data, the stock traded at a P/E multiple of 50.8 and a price-to-book ratio of 12.22. A higher P/E ratio shows investors are willing to pay a higher price because of better future growth expectations. Price-to-book value indicates the inherent value of a company and is the measure of the price that investors are ready to pay even for no growth in the business. LTIMindtree Ltd. belongs to the IT Consulting & Software - Mid Cap industry. ", "date": "2022-12-30", "resolved_text": "NEW DELHI: Shares of LTIMindtree Ltd. traded 0.64 per cent down in Friday's trade at 01:17PM (IST). Around 7,140 shares changed hands on the counter. the counter opened at Rs 4421.05 and touched an intraday high and low of Rs 4471.05 and Rs 4392.0, respectively, in the session so far. The stock of LTIMindtree Ltd. quoted a 52-week high of Rs 7595.25 and a 52-week low of Rs 3733.25. As per BSE , the total market cap of LTIMindtree Ltd. stood at Rs 130150.22 crore at the time of writing this report. LTIMindtree Ltd. reported consolidated sales of Rs 4976.0 crore for the quarter ended 30-Sep-2022, up 6.62 per cent from previous quarter's's Rs 4666.9 crore and up 28.31 per cent from previous quarter's's Rs 3878.2 crore. The net profit for latest quarter stood at Rs 679.3 crore, up 23.17 per cent from previous quarter's. As of the quarter ended 30-Sep-2022, domestic institutional investors held 5.09 per cent stake in LTIMindtree Ltd., while foreign institutional investors held 8.42 per cent and the promoters 74.03 per cent. According to BSE data, The stock of LTIMindtree Ltd. traded at a P/E multiple of 50.8 and a price-to-book ratio of 12.22. A higher P/E ratio shows investors are willing to pay a higher price because of better future growth expectations. Price-to-book value indicates the inherent value of a company and is the measure of the price that investors are ready to pay even for no growth in a company. LTIMindtree Ltd. belongs to the IT Consulting & Software - Mid Cap industry. ", "sentiment_score": -0.43, "sentiment_class": "Negative", "sentiment_class_value": -2}, {"_id": {"$oid": "63af192a37c41e98a353f27f"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-nifty-it-index-advances-0-45-in-an-upbeat-market/articleshow/96614235.cms", "title": "Stock market update: Nifty IT index advances 0.45% in an upbeat market", "datetime": "2022-12-30 11:22", "content": "NEW DELHI: The Nifty IT index traded positive around 11:22AM(IST)on Friday in an upbeat market. MPhasis(up 3.03 per cent), Persistent Systems(up 2.15 per cent), L&T Technology(up 1.11 per cent), Coforge(up 0.85 per cent) and Tech Mahindra(up 0.77 per cent) were among the top gainers. HCL Technologies(down 0.43 per cent) and LTIMindtree Ltd(down 0.28 per cent) were the top losers on the index. The Nifty IT index was up 0.45 per cent at 28816.85 at the time of writing this report. Benchmark NSE Nifty50 index was up 20.8 points at 18211.8, while the BSE Sensex was up 88.37 points at 61222.25. Among the 50 stocks in the Nifty index, 25 were trading in the green, while 24 were in the red. Shares of , , PNB, and were among the most traded shares on the NSE. Shares of , , Baheti Recycling Industries Ltd., Pritika Engineering Components Ltd. and hit their fresh 52-week highs in today's trade, while Elin Electronics Ltd., Inds., , Godha Cabcon & Insul and hit fresh 52-week lows in trade. ", "date": "2022-12-30", "resolved_text": "NEW DELHI: The Nifty IT index traded positive around 11:22AM(IST)on Friday in an upbeat market. MPhasis(up 3.03 per cent), Persistent Systems(up 2.15 per cent), L&T Technology(up 1.11 per cent), Coforge(up 0.85 per cent) and Tech Mahindra(up 0.77 per cent) were among the top gainers. HCL Technologies(down 0.43 per cent) and LTIMindtree Ltd(down 0.28 per cent) were the top losers on The Nifty IT index. The Nifty IT index was up 0.45 per cent at 28816.85 at the time of writing this report. Benchmark NSE Nifty50 index was up 20.8 points at 18211.8, while the BSE Sensex was up 88.37 points at 61222.25. Among the 50 stocks in The Nifty IT index, 25 were trading in the green, while 24 were in the red. Shares of , , PNB, and were among the most traded shares on The Nifty IT index. Shares of , , Baheti Recycling Industries Ltd., Pritika Engineering Components Ltd. and hit Shares of , , Baheti Recycling Industries Ltd., Pritika Engineering Components Ltd. and's fresh 52-week highs in today's trade, while Elin Electronics Ltd., Inds., , Godha Cabcon & Insul and hit fresh 52-week lows in trade. ", "sentiment_score": 0.0, "sentiment_class": "Neutral", "sentiment_class_value": 0}, {"_id": {"$oid": "63af4272a196a33fd1a31532"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-nifty-it-index-falls-0-23/printarticle/96622168.cms", "title": "Stock market update: Nifty IT index falls 0.23% - The Economic Times", "datetime": "2022-12-30 16:36", "content": "NEW DELHI: The Nifty IT index closed on a negative note on Friday. Shares of MPhasis(up 2.13 per cent), Persistent Systems(up 1.13 per cent), L&T Technology(up 0.66 per cent), Wipro(up 0.51 per cent) and Tech Mahindra(up 0.32 per cent) ended the day as top gainers in the pack. On the other hand, LTIMindtree Ltd(down 1.24 per cent), Coforge(down 0.8 per cent), Infosys(down 0.62 per cent), HCL Technologies(down 0.49 per cent) and Tata Consultancy(down 0.37 per cent) finished as the top losers of the day. The Nifty IT index closed 0.23 per cent down at 28621.7. Benchmark NSE Nifty50 index ended down 85.7 points at 18105.3, while the BSE Sensex stood down 293.14 points at 60840.74. Among the 50 stocks in the Nifty index, 19 ended in the green, while 31 closed in the red. Shares of , , , PNB and IOB were among the most traded shares on the NSE. Shares of , Pritika Engineering Components Ltd., , Baheti Recycling Industries Ltd. and hit their fresh 52-week highs in today's trade, while Elin Electronics Ltd., KFIN Technologies Ltd., Inds., and P&G Health hit their fresh 52-week lows. ", "date": "2022-12-30", "resolved_text": "NEW DELHI: The Nifty IT index closed on a negative note on Friday. Shares of MPhasis(up 2.13 per cent), Persistent Systems(up 1.13 per cent), L&T Technology(up 0.66 per cent), Wipro(up 0.51 per cent) and Tech Mahindra(up 0.32 per cent) ended Friday as top gainers in the pack. On the other hand, LTIMindtree Ltd(down 1.24 per cent), Coforge(down 0.8 per cent), Infosys(down 0.62 per cent), HCL Technologies(down 0.49 per cent) and Tata Consultancy(down 0.37 per cent) finished as the top losers of Friday. The Nifty IT index closed 0.23 per cent down at 28621.7. Benchmark NSE Nifty50 index ended down 85.7 points at 18105.3, while the BSE Sensex stood down 293.14 points at 60840.74. Among the 50 stocks in The Nifty IT index, 19 ended in the green, while 31 closed in the red. Shares of , , , PNB and IOB were among the most traded shares on NSE. Shares of , Pritika Engineering Components Ltd., , Baheti Recycling Industries Ltd. and hit Shares of , Pritika Engineering Components Ltd., , Baheti Recycling Industries Ltd. and's fresh 52-week highs in Friday's trade, while Elin Electronics Ltd., KFIN Technologies Ltd., Inds., and P&G Health hit Elin Electronics Ltd., KFIN Technologies Ltd., Inds., and P&G Health's fresh 52-week lows. ", "sentiment_score": 0.0, "sentiment_class": "Neutral", "sentiment_class_value": 0}, {"_id": {"$oid": "63af440537c41e98a35402c5"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/lt-infotech-shares-down-0-64-as-nifty-drops/printarticle/96617068.cms", "title": "L&T Infotech shares down 0.64% as Nifty drops - The Economic Times", "datetime": "2022-12-30 13:17", "content": "NEW DELHI: Shares of LTIMindtree Ltd. traded 0.64 per cent down in Friday's trade at 01:17PM (IST). Around 7,140 shares changed hands on the counter. The counter opened at Rs 4421.05 and touched an intraday high and low of Rs 4471.05 and Rs 4392.0, respectively, in the session so far. The stock of LTIMindtree Ltd. quoted a 52-week high of Rs 7595.25 and a 52-week low of Rs 3733.25. As per BSE , the total market cap of the LTIMindtree Ltd. stood at Rs 130150.22 crore at the time of writing this report. The company reported consolidated sales of Rs 4976.0 crore for the quarter ended 30-Sep-2022, up 6.62 per cent from previous quarter's Rs 4666.9 crore and up 28.31 per cent from the year-ago quarter's Rs 3878.2 crore. The net profit for latest quarter stood at Rs 679.3 crore, up 23.17 per cent from the same quarter a year ago. As of 30-Sep-2022, domestic institutional investors held 5.09 per cent stake in the firm, while foreign institutional investors held 8.42 per cent and the promoters 74.03 per cent. According to BSE data, the stock traded at a P/E multiple of 50.8 and a price-to-book ratio of 12.22. A higher P/E ratio shows investors are willing to pay a higher price because of better future growth expectations. Price-to-book value indicates the inherent value of a company and is the measure of the price that investors are ready to pay even for no growth in the business. LTIMindtree Ltd. belongs to the IT Consulting & Software - Mid Cap industry. ", "date": "2022-12-30", "resolved_text": "NEW DELHI: Shares of LTIMindtree Ltd. traded 0.64 per cent down in Friday's trade at 01:17PM (IST). Around 7,140 shares changed hands on the counter. the counter opened at Rs 4421.05 and touched an intraday high and low of Rs 4471.05 and Rs 4392.0, respectively, in the session so far. The stock of LTIMindtree Ltd. quoted a 52-week high of Rs 7595.25 and a 52-week low of Rs 3733.25. As per BSE , the total market cap of LTIMindtree Ltd. stood at Rs 130150.22 crore at the time of writing this report. LTIMindtree Ltd. reported consolidated sales of Rs 4976.0 crore for the quarter ended 30-Sep-2022, up 6.62 per cent from previous quarter's's Rs 4666.9 crore and up 28.31 per cent from previous quarter's's Rs 3878.2 crore. The net profit for latest quarter stood at Rs 679.3 crore, up 23.17 per cent from previous quarter's. As of the quarter ended 30-Sep-2022, domestic institutional investors held 5.09 per cent stake in LTIMindtree Ltd., while foreign institutional investors held 8.42 per cent and the promoters 74.03 per cent. According to BSE data, The stock of LTIMindtree Ltd. traded at a P/E multiple of 50.8 and a price-to-book ratio of 12.22. A higher P/E ratio shows investors are willing to pay a higher price because of better future growth expectations. Price-to-book value indicates the inherent value of a company and is the measure of the price that investors are ready to pay even for no growth in a company. LTIMindtree Ltd. belongs to the IT Consulting & Software - Mid Cap industry. ", "sentiment_score": -0.43, "sentiment_class": "Negative", "sentiment_class_value": -2}, {"_id": {"$oid": "63af4504a196a33fd1a31578"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-nifty-it-index-advances-0-45-in-an-upbeat-market/printarticle/96614235.cms", "title": "Stock market update: Nifty IT index advances 0.45% in an upbeat market - The Economic Times", "datetime": "2022-12-30 11:22", "content": "NEW DELHI: The Nifty IT index traded positive around 11:22AM(IST)on Friday in an upbeat market. MPhasis(up 3.03 per cent), Persistent Systems(up 2.15 per cent), L&T Technology(up 1.11 per cent), Coforge(up 0.85 per cent) and Tech Mahindra(up 0.77 per cent) were among the top gainers. HCL Technologies(down 0.43 per cent) and LTIMindtree Ltd(down 0.28 per cent) were the top losers on the index. The Nifty IT index was up 0.45 per cent at 28816.85 at the time of writing this report. Benchmark NSE Nifty50 index was up 20.8 points at 18211.8, while the BSE Sensex was up 88.37 points at 61222.25. Among the 50 stocks in the Nifty index, 25 were trading in the green, while 24 were in the red. Shares of , , PNB, and were among the most traded shares on the NSE. Shares of , , Baheti Recycling Industries Ltd., Pritika Engineering Components Ltd. and hit their fresh 52-week highs in today's trade, while Elin Electronics Ltd., Inds., , Godha Cabcon & Insul and hit fresh 52-week lows in trade. ", "date": "2022-12-30", "resolved_text": "NEW DELHI: The Nifty IT index traded positive around 11:22AM(IST)on Friday in an upbeat market. MPhasis(up 3.03 per cent), Persistent Systems(up 2.15 per cent), L&T Technology(up 1.11 per cent), Coforge(up 0.85 per cent) and Tech Mahindra(up 0.77 per cent) were among the top gainers. HCL Technologies(down 0.43 per cent) and LTIMindtree Ltd(down 0.28 per cent) were the top losers on The Nifty IT index. The Nifty IT index was up 0.45 per cent at 28816.85 at the time of writing this report. Benchmark NSE Nifty50 index was up 20.8 points at 18211.8, while the BSE Sensex was up 88.37 points at 61222.25. Among the 50 stocks in The Nifty IT index, 25 were trading in the green, while 24 were in the red. Shares of , , PNB, and were among the most traded shares on The Nifty IT index. Shares of , , Baheti Recycling Industries Ltd., Pritika Engineering Components Ltd. and hit Shares of , , Baheti Recycling Industries Ltd., Pritika Engineering Components Ltd. and's fresh 52-week highs in today's trade, while Elin Electronics Ltd., Inds., , Godha Cabcon & Insul and hit fresh 52-week lows in trade. ", "sentiment_score": 0.0, "sentiment_class": "Neutral", "sentiment_class_value": 0}], "2022-12-29": [{"_id": {"$oid": "63af1a2137c41e98a353f3b6"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-nifty-it-index-advances-0-36/articleshow/96597242.cms", "title": "Stock market update: Nifty IT index advances 0.36%", "datetime": "2022-12-29 16:57", "content": "NEW DELHI: The Nifty IT index closed on a positive note on Thursday. Shares of LTIMindtree Ltd(up 2.04 per cent), HCL Technologies(up 0.87 per cent), Wipro(up 0.76 per cent), Infosys(up 0.49 per cent) and Tata Consultancy(up 0.36 per cent) ended the day as top gainers in the pack. On the other hand, L&T Technology(down 1.1 per cent), Persistent Systems(down 0.84 per cent), MPhasis(down 0.45 per cent) and Tech Mahindra(down 0.3 per cent) finished as the top losers of the day. The Nifty IT index closed 0.36 per cent up at 28687.2. Benchmark NSE Nifty50 index ended up 68.5 points at 18191.0, while the BSE Sensex stood up 223.6 points at 61133.88. Among the 50 stocks in the Nifty index, 31 ended in the green, while 18 closed in the red. Shares of , IOB, PNB, and were among the most traded shares on the NSE. Shares of Uma Converter Ltd., Academy Ltd., , and Swastik Pipe Ltd. hit their fresh 52-week highs in today's trade, while , , Inds., Godha Cabcon & Insul and Abans Holdings Ltd. hit their fresh 52-week lows. ", "date": "2022-12-29", "resolved_text": "NEW DELHI: The Nifty IT index closed on a positive note on Thursday. Shares of LTIMindtree Ltd(up 2.04 per cent), HCL Technologies(up 0.87 per cent), Wipro(up 0.76 per cent), Infosys(up 0.49 per cent) and Tata Consultancy(up 0.36 per cent) ended Thursday as top gainers in the pack. On the other hand, L&T Technology(down 1.1 per cent), Persistent Systems(down 0.84 per cent), MPhasis(down 0.45 per cent) and Tech Mahindra(down 0.3 per cent) finished as the top losers of Thursday. The Nifty IT index closed 0.36 per cent up at 28687.2. Benchmark NSE Nifty50 index ended up 68.5 points at 18191.0, while the BSE Sensex stood up 223.6 points at 61133.88. Among the 50 stocks in The Nifty IT index, 31 ended in the green, while 18 closed in the red. Shares of , IOB, PNB, and were among the most traded shares on NSE. Shares of Uma Converter Ltd., Academy Ltd., , and Swastik Pipe Ltd. hit Shares of Uma Converter Ltd., Academy Ltd., , and Swastik Pipe Ltd.'s fresh 52-week highs in Thursday's trade, while , , Inds., Godha Cabcon & Insul and Abans Holdings Ltd. hit Inds., Godha Cabcon & Insul and Abans Holdings Ltd.'s fresh 52-week lows. ", "sentiment_score": 1.0, "sentiment_class": "Positive", "sentiment_class_value": 2}, {"_id": {"$oid": "63af1ae537c41e98a353f463"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/lt-infotech-shares-drop-0-08-as-sensex-falls/articleshow/96588935.cms", "title": "L&T Infotech shares drop 0.08% as Sensex falls ", "datetime": "2022-12-29 12:04", "content": "Shares of LTIMindtree Ltd. traded 0.08 per cent down at Rs 4335.5 at 12:04PM (IST) on Thursday, even as BSE benchmark Sensex dropped 268.2 points to 60642.08. The scrip had closed at Rs 4338.8 in the previous session. The stock quoted a 52-week high price of Rs 7595.25 and 52-week low of Rs 3733.25, respectively. As per BSE data, total traded volume on the counter till 12:04PM (IST) stood at 7224 shares with a turnover of Rs 3.11 crore. At the prevailing price, shares of the company traded at 49.94 times its trailing 12-month earnings per share of Rs 86.61 per share and 12.22 times its price-to-book value, exchange data showed. A higher P/E ratio shows investors are willing to pay a higher share price today because of growth expectations in the future. Price-to-book value indicates the inherent value of a company and reflects the price investors are ready to pay even for no growth in the business. The stock's Beta value, which measures its volatility in relation to the broader market, stood at 0.59. Promoters held 74.03 per cent stake in the company as of 30-Sep-2022, while FIIs owned 8.42 per cent and DIIs 5.09 per cent. On the technical charts, the relative strength index (RSI) of the stock stood at 39.37. The RSI oscillates between zero and 100. Traditionally, it is considered overbought condition when the RSI value is above 70 and oversold condition when it is below 30. Chartists say, RSI should not be seen in isolation, as it may not be sufficient to take a trading call, just the way fundamental analysts cannot give a'buy' or'sell' recommendation using a single valuation ratio. ", "date": "2022-12-29", "resolved_text": "Shares of LTIMindtree Ltd. traded 0.08 per cent down at Rs 4335.5 at 12:04PM (IST) on Thursday, even as BSE benchmark Sensex dropped 268.2 points to 60642.08. BSE benchmark Sensex had closed at Rs 4338.8 in the previous session. LTIMindtree Ltd. quoted a 52-week high price of Rs 7595.25 and 52-week low of Rs 3733.25, respectively. As per BSE data, total traded volume on the counter till 12:04PM (IST) stood at 7224 shares with a turnover of Rs 3.11 crore. At the prevailing price, shares of LTIMindtree Ltd. traded at 49.94 times LTIMindtree Ltd.'s trailing 12-month earnings per share of Rs 86.61 per share and 12.22 times LTIMindtree Ltd.'s price-to-book value, exchange data showed. A higher P/E ratio shows investors are willing to pay a higher share price today because of growth expectations in the future. Price-to-book value indicates the inherent value of a company and reflects the price investors are ready to pay even for no growth in a company. LTIMindtree Ltd.'s Beta value, which measures LTIMindtree Ltd.'s volatility in relation to the broader market, stood at 0.59. Promoters held 74.03 per cent stake in LTIMindtree Ltd. as of 30-Sep-2022, while FIIs owned 8.42 per cent and DIIs 5.09 per cent. On the technical charts, the relative strength index (RSI) of LTIMindtree Ltd. stood at 39.37. the relative strength index (RSI) of the stock oscillates between zero and 100. Traditionally, the relative strength index (RSI) of the stock is considered overbought condition when the RSI value is above 70 and oversold condition when the RSI value is below 30. Chartists say, the relative strength index (RSI) of the stock should not be seen in isolation, as the relative strength index (RSI) of the stock may not be sufficient to take a trading call, just the way fundamental analysts cannot give a'buy' or'sell' recommendation using a single valuation ratio. ", "sentiment_score": -0.67, "sentiment_class": "Negative", "sentiment_class_value": -2}, {"_id": {"$oid": "63af488b37c41e98a354035b"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-nifty-it-index-advances-0-36/printarticle/96597242.cms", "title": "Stock market update: Nifty IT index advances 0.36% - The Economic Times", "datetime": "2022-12-29 16:57", "content": "NEW DELHI: The Nifty IT index closed on a positive note on Thursday. Shares of LTIMindtree Ltd(up 2.04 per cent), HCL Technologies(up 0.87 per cent), Wipro(up 0.76 per cent), Infosys(up 0.49 per cent) and Tata Consultancy(up 0.36 per cent) ended the day as top gainers in the pack. On the other hand, L&T Technology(down 1.1 per cent), Persistent Systems(down 0.84 per cent), MPhasis(down 0.45 per cent) and Tech Mahindra(down 0.3 per cent) finished as the top losers of the day. The Nifty IT index closed 0.36 per cent up at 28687.2. Benchmark NSE Nifty50 index ended up 68.5 points at 18191.0, while the BSE Sensex stood up 223.6 points at 61133.88. Among the 50 stocks in the Nifty index, 31 ended in the green, while 18 closed in the red. Shares of , IOB, PNB, and were among the most traded shares on the NSE. Shares of Uma Converter Ltd., Academy Ltd., , and Swastik Pipe Ltd. hit their fresh 52-week highs in today's trade, while , , Inds., Godha Cabcon & Insul and Abans Holdings Ltd. hit their fresh 52-week lows. ", "date": "2022-12-29", "resolved_text": "NEW DELHI: The Nifty IT index closed on a positive note on Thursday. Shares of LTIMindtree Ltd(up 2.04 per cent), HCL Technologies(up 0.87 per cent), Wipro(up 0.76 per cent), Infosys(up 0.49 per cent) and Tata Consultancy(up 0.36 per cent) ended Thursday as top gainers in the pack. On the other hand, L&T Technology(down 1.1 per cent), Persistent Systems(down 0.84 per cent), MPhasis(down 0.45 per cent) and Tech Mahindra(down 0.3 per cent) finished as the top losers of Thursday. The Nifty IT index closed 0.36 per cent up at 28687.2. Benchmark NSE Nifty50 index ended up 68.5 points at 18191.0, while the BSE Sensex stood up 223.6 points at 61133.88. Among the 50 stocks in The Nifty IT index, 31 ended in the green, while 18 closed in the red. Shares of , IOB, PNB, and were among the most traded shares on NSE. Shares of Uma Converter Ltd., Academy Ltd., , and Swastik Pipe Ltd. hit Shares of Uma Converter Ltd., Academy Ltd., , and Swastik Pipe Ltd.'s fresh 52-week highs in Thursday's trade, while , , Inds., Godha Cabcon & Insul and Abans Holdings Ltd. hit Inds., Godha Cabcon & Insul and Abans Holdings Ltd.'s fresh 52-week lows. ", "sentiment_score": 1.0, "sentiment_class": "Positive", "sentiment_class_value": 2}, {"_id": {"$oid": "63af4b0837c41e98a35403a5"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/lt-infotech-shares-drop-0-08-as-sensex-falls/printarticle/96588935.cms", "title": "L&T Infotech shares drop 0.08% as Sensex falls - The Economic Times", "datetime": "2022-12-29 12:04", "content": "Shares of LTIMindtree Ltd. traded 0.08 per cent down at Rs 4335.5 at 12:04PM (IST) on Thursday, even as BSE benchmark Sensex dropped 268.2 points to 60642.08. The scrip had closed at Rs 4338.8 in the previous session. The stock quoted a 52-week high price of Rs 7595.25 and 52-week low of Rs 3733.25, respectively. As per BSE data, total traded volume on the counter till 12:04PM (IST) stood at 7224 shares with a turnover of Rs 3.11 crore. At the prevailing price, shares of the company traded at 49.94 times its trailing 12-month earnings per share of Rs 86.61 per share and 12.22 times its price-to-book value, exchange data showed. A higher P/E ratio shows investors are willing to pay a higher share price today because of growth expectations in the future. Price-to-book value indicates the inherent value of a company and reflects the price investors are ready to pay even for no growth in the business. The stock's Beta value, which measures its volatility in relation to the broader market, stood at 0.59. Promoters held 74.03 per cent stake in the company as of 30-Sep-2022, while FIIs owned 8.42 per cent and DIIs 5.09 per cent. On the technical charts, the relative strength index (RSI) of the stock stood at 39.37. The RSI oscillates between zero and 100. Traditionally, it is considered overbought condition when the RSI value is above 70 and oversold condition when it is below 30. Chartists say, RSI should not be seen in isolation, as it may not be sufficient to take a trading call, just the way fundamental analysts cannot give a'buy' or'sell' recommendation using a single valuation ratio. ", "date": "2022-12-29", "resolved_text": "Shares of LTIMindtree Ltd. traded 0.08 per cent down at Rs 4335.5 at 12:04PM (IST) on Thursday, even as BSE benchmark Sensex dropped 268.2 points to 60642.08. BSE benchmark Sensex had closed at Rs 4338.8 in the previous session. LTIMindtree Ltd. quoted a 52-week high price of Rs 7595.25 and 52-week low of Rs 3733.25, respectively. As per BSE data, total traded volume on the counter till 12:04PM (IST) stood at 7224 shares with a turnover of Rs 3.11 crore. At the prevailing price, shares of LTIMindtree Ltd. traded at 49.94 times LTIMindtree Ltd.'s trailing 12-month earnings per share of Rs 86.61 per share and 12.22 times LTIMindtree Ltd.'s price-to-book value, exchange data showed. A higher P/E ratio shows investors are willing to pay a higher share price today because of growth expectations in the future. Price-to-book value indicates the inherent value of a company and reflects the price investors are ready to pay even for no growth in a company. LTIMindtree Ltd.'s Beta value, which measures LTIMindtree Ltd.'s volatility in relation to the broader market, stood at 0.59. Promoters held 74.03 per cent stake in LTIMindtree Ltd. as of 30-Sep-2022, while FIIs owned 8.42 per cent and DIIs 5.09 per cent. On the technical charts, the relative strength index (RSI) of LTIMindtree Ltd. stood at 39.37. the relative strength index (RSI) of the stock oscillates between zero and 100. Traditionally, the relative strength index (RSI) of the stock is considered overbought condition when the RSI value is above 70 and oversold condition when the RSI value is below 30. Chartists say, the relative strength index (RSI) of the stock should not be seen in isolation, as the relative strength index (RSI) of the stock may not be sufficient to take a trading call, just the way fundamental analysts cannot give a'buy' or'sell' recommendation using a single valuation ratio. ", "sentiment_score": -0.67, "sentiment_class": "Negative", "sentiment_class_value": -2}], "2022-12-28": [{"_id": {"$oid": "63af4e0937c41e98a3540438"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-nifty-it-index-falls-0-18/articleshow/96570116.cms", "title": "Stock market update: Nifty IT index falls 0.18%", "datetime": "2022-12-28 16:20", "content": "NEW DELHI: The Nifty IT index closed on a negative note on Wednesday. Shares of Coforge(up 1.04 per cent), Tech Mahindra(up 0.66 per cent) and Wipro(up 0.31 per cent) ended the day as top gainers in the pack. On the other hand, L&T Technology(down 1.92 per cent), Persistent Systems(down 1.43 per cent), LTIMindtree Ltd(down 1.33 per cent), Infosys(down 0.31 per cent) and HCL Technologies(down 0.09 per cent) finished as the top losers of the day. The Nifty IT index closed 0.18 per cent down at 28583.45. Benchmark NSE Nifty50 index ended down 9.8 points at 18122.5, while the BSE Sensex stood down 17.15 points at 60910.28. Among the 50 stocks in the Nifty index, 21 ended in the green, while 29 closed in the red. Shares of , IOB, PNB, and Ltd. were among the most traded shares on the NSE. Shares of Dollex Agrotech Ltd., , Ltd., and FACT hit their fresh 52-week highs in today's trade, while Godha Cabcon & Insul, Inds., C.E. Info., and Baheti Recycling Industries Ltd. hit their fresh 52-week lows. ", "date": "2022-12-28", "resolved_text": "NEW DELHI: The Nifty IT index closed on a negative note on Wednesday. Shares of Coforge(up 1.04 per cent), Tech Mahindra(up 0.66 per cent) and Wipro(up 0.31 per cent) ended Wednesday as top gainers in the pack. On the other hand, L&T Technology(down 1.92 per cent), Persistent Systems(down 1.43 per cent), LTIMindtree Ltd(down 1.33 per cent), Infosys(down 0.31 per cent) and HCL Technologies(down 0.09 per cent) finished as the top losers of Wednesday. The Nifty IT index closed 0.18 per cent down at 28583.45. Benchmark NSE Nifty50 index ended down 9.8 points at 18122.5, while the BSE Sensex stood down 17.15 points at 60910.28. Among the 50 stocks in The Nifty IT index, 21 ended in the green, while 29 closed in the red. Shares of , IOB, PNB, and Ltd. were among the most traded shares on NSE. Shares of Dollex Agrotech Ltd., , Ltd., and FACT hit Shares of Dollex Agrotech Ltd., , Ltd., and FACT's fresh 52-week highs in Wednesday's trade, while Godha Cabcon & Insul, Inds., C.E. Info., and Baheti Recycling Industries Ltd. hit Godha Cabcon & Insul, Inds., C.E. Info., and Baheti Recycling Industries Ltd.'s fresh 52-week lows. ", "sentiment_score": 0.0, "sentiment_class": "Neutral", "sentiment_class_value": 0}, {"_id": {"$oid": "63af7b64c66f1e9c2e1abea4"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/lt-infotech-share-price-down-0-94-per-cent/articleshow/96566142.cms", "title": "L&T Infotech share price down 0.94 per cent", "datetime": "2022-12-28 13:56", "content": "Shares of LTIMindtree Ltd. traded 0.94 per cent up at Rs 4347.7 at around 01:56PM (IST) on Wednesday. The stock had closed at Rs 4389.1 in the previous session. Equity benchmark Sensex traded 101.26 points higher at 61028.69 around the same time. The scrip has declined 40.21 per cent in the last one year till date, while the 30-share index has gained 8.37 per cent during the same period. The stock's 52-week high price stood at Rs 7595.25 and the 52-week low price at Rs 3733.25. Trading volume on the counter stood at 4,936 shares, while it quoted a price-to-earnings ratio of 50.16, an EPS value of 86.61 and a price-to-book value of 12.22. In the Nifty50 pack, 32 stocks traded in the green, while 18 stocks were in the red. Promoters held 74.0 per cent stake in the company as of 30-Sep-2022, while FII and mutual funds' ownership stood at 8.42 per cent and 4.74 per cent, respectively. For the quarter ended 30-Sep-2022, the company reported consolidated sales of Rs 4976.0 crore, up 6.62 per cent from the previous quarter's Rs 4666.9 crore and up 28.31 per cent from the year-ago quarter's Rs 3878.2 crore. The company reported net profit of Rs 679.3 crore for the latest quarter. The MACD signalled a bearish bias on the counter. The MACD is known for signalling trend reversals in traded securities or indices. It is the difference between the 26-day and 12-day exponential moving averages. A nine-day exponential moving average, called the signal line, is plotted on top of the MACD to reflect \"buy\" or \"sell\" opportunities. When the MACD crosses below the signal line, it gives a bearish signal, indicating that the price of the security may see a downward movement and vice versa. ", "date": "2022-12-28", "resolved_text": "Shares of LTIMindtree Ltd. traded 0.94 per cent up at Rs 4347.7 at around 01:56PM (IST) on Wednesday. LTIMindtree Ltd. had closed at Rs 4389.1 in the previous session. Equity benchmark Sensex traded 101.26 points higher at 61028.69 around the same time. Equity benchmark Sensex has declined 40.21 per cent in the last one year till date, while the 30-share index has gained 8.37 per cent during the last one year till date. LTIMindtree Ltd.'s 52-week high price stood at Rs 7595.25 and the 52-week low price at Rs 3733.25. Trading volume on the counter stood at 4,936 shares, while the counter quoted a price-to-earnings ratio of 50.16, an EPS value of 86.61 and a price-to-book value of 12.22. In the Nifty50 pack, 32 stocks traded in the green, while 18 stocks were in the red. Promoters held 74.0 per cent stake in LTIMindtree Ltd. as of 30-Sep-2022, while FII and mutual funds' ownership stood at 8.42 per cent and 4.74 per cent, respectively. For the quarter ended 30-Sep-2022, LTIMindtree Ltd. reported consolidated sales of Rs 4976.0 crore, up 6.62 per cent from the previous quarter's's Rs 4666.9 crore and up 28.31 per cent from the previous quarter's's Rs 3878.2 crore. LTIMindtree Ltd. reported net profit of Rs 679.3 crore for the latest quarter. The MACD signalled a bearish bias on the counter. The MACD is known for signalling trend reversals in traded securities or indices. The MACD is the difference between the 26-day and 12-day exponential moving averages. A nine-day exponential moving average, called the signal line, is plotted on top of The MACD to reflect \"buy\" or \"sell\" opportunities. When The MACD crosses below A nine-day exponential moving average, called the signal line,, The MACD gives a bearish signal, indicating that the price of the security may see a downward movement and vice versa. ", "sentiment_score": -0.33, "sentiment_class": "Negative", "sentiment_class_value": -2}], "2022-12-27": [{"_id": {"$oid": "63af4e0a37c41e98a354043a"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-nifty-it-index-advances-0-1-in-a-weak-market/articleshow/96533883.cms", "title": "Stock market update: Nifty IT index advances 0.1% in a weak market", "datetime": "2022-12-27 09:59", "content": "NEW DELHI: The Nifty IT index traded positive around 09:59AM(IST)on Tuesday in a weak market. Coforge(up 1.94 per cent), Persistent Systems(up 1.65 per cent), LTIMindtree Ltd(up 0.76 per cent), Wipro(up 0.57 per cent) and L&T Technology(up 0.49 per cent) were among the top gainers. Tata Consultancy(down 0.46 per cent), Tech Mahindra(down 0.13 per cent) and Infosys(down 0.03 per cent) were the top losers on the index. The Nifty IT index was up 0.1 per cent at 28415.3 at the time of writing this report. Benchmark NSE Nifty50 index was down 29.3 points at 17985.3, while the BSE Sensex was down 103.46 points at 60462.96. Among the 50 stocks in the Nifty index, 22 were trading in the green, while 28 were in the red. Shares of , IOB, PNB, and were among the most traded shares on the NSE. Shares of., , , and Madhya Bharat Agro hit their fresh 52-week highs in today's trade, while Sintex Inds., , , and hit fresh 52-week lows in trade. ", "date": "2022-12-27", "resolved_text": "NEW DELHI: The Nifty IT index traded positive around 09:59AM(IST)on Tuesday in a weak market. Coforge(up 1.94 per cent), Persistent Systems(up 1.65 per cent), LTIMindtree Ltd(up 0.76 per cent), Wipro(up 0.57 per cent) and L&T Technology(up 0.49 per cent) were among the top gainers. Tata Consultancy(down 0.46 per cent), Tech Mahindra(down 0.13 per cent) and Infosys(down 0.03 per cent) were the top losers on The Nifty IT index. The Nifty IT index was up 0.1 per cent at 28415.3 at the time of writing this report. Benchmark NSE Nifty50 index was down 29.3 points at 17985.3, while the BSE Sensex was down 103.46 points at 60462.96. Among the 50 stocks in The Nifty IT index, 22 were trading in the green, while 28 were in the red. Shares of , IOB, PNB, and were among the most traded shares on the NSE. Shares of., , , and Madhya Bharat Agro hit Shares of., , , and Madhya Bharat Agro's fresh 52-week highs in today's trade, while Sintex Inds., , , and hit fresh 52-week lows in trade. ", "sentiment_score": 1.0, "sentiment_class": "Positive", "sentiment_class_value": 2}], "2022-12-26": [{"_id": {"$oid": "63af1b3d9ef48667cfe92dfc"}, "url": "https://www.moneycontrol.com/news/business/markets/top-10-trading-ideas-for-next-3-4-weeks-as-indices-trade-lower-headwinds-linger-9762951.html", "title": "Top 10 trading ideas for next 3-4 weeks as indices trade lower, headwinds linger", "datetime": "2022-12-26 09:57", "content": " A host of news such as a spike in Covid cases across several countries, fear of further policy tightening by the Federal Reserve and a growing chance of recession battered the market in the week ended December 23. India's benchmark indices hit near two-month lows as all sectors, barring healthcare, witnessed heavy selling. The BSE Sensex crashed nearly 1,500 points during the week to 59,845, while the Nifty50 tanked 460 points to 17,807, the lowest closing level since October 28. The 50-share NSE benchmark index has formed a long bearish candle on the weekly timeframe with lower highs, lower lows for the second straight week, while on the daily charts, after a sharp gap-down opening, there was also a long bearish candle formation with lower lows, lower highs for the second straight day. The Nifty50 closed near its 50 percent Fib retracement (from 16,747 on September 30 and new high of 18,887 on December 1), which can be crucial level to watch out for the next week. Also the index is close to 100 DMA (daily moving average) as well as 100 EMA (exponential moving average) which is around 17,840. All these indicate that 17,800 is expected to be a crucial level in the coming week, and considering the RSI (relative strength index) near the oversold zone on the daily charts, the rebound can't be ruled out led by short-covering, experts said. \"Taking a glance at the daily and weekly time-frame charts, we see a cluster of technical evidence. We reckon the downside will be limited hereon. This expectation will become a reality in the coming sessions,\" Sameet Chavan, Chief Analyst, Technical and Derivatives at Angel One, said. As far as levels are concerned, he feels 17,900-18,050 are to be seen as the immediate hurdles, and only a close above the upper range would confirm the resumption of an uptrend. On the flipside, an extended correction below 17,750-17,700 would drag the Nifty towards the next important support zone of 17,600-17,450, the expert said. The broader markets faced intense selling pressure last week, with the Nifty Midcap 100 and Smallcap 100 indices declining 5.8 percent and 8.3 percent. Sameet Chavan advised traders to avoid making aggressive bets for a while and wait for the Nifty to reclaim 18,050. \"It's an excellent opportunity for investors to start nibbling at quality propositions as most of the counters are significantly off their recent highs,\" he said. Let's take a look at the top 10 trading ideas by experts for the next three-four weeks. Returns are based on the December 23 closing prices: Expert: Shrikant Chouhan, Head of Equity Research (Retail) at Kotak Securities Bank of Baroda: Buy | LTP: Rs 169 | Stop-Loss: Rs 159 | Target: Rs 188 | Return: 11 percent The stock made an all-time high at Rs 197.20, however, later it failed to form a higher range which pushed the stock lower. Selling was equally intense and the stock fell to Rs 170, which is its support line based on the Fibonacci retracement. It is at 38.20 percent support line. If the weakness extends then the stock will slide towards Rs 160 which will be the support level as per the 50 percent retracement ratio. As the sector is in a bullish trend, we can expect a sharp bounce back if support is found. The strategy should be to buy between Rs 171 and Rs 162, with a stop-loss at Rs 159. Resistance will be Rs 180 and Rs 188. Sun Pharma: Buy | LTP: Rs 1,001 | Stop-Loss: Rs 970 | Target: Rs 1,100 | Return: 10 percent The stock has completed a corrective pattern at Rs 975 and has reversed sharply on the back of fundamentally positive news flow, which will help the stock to exhibit a trending move in the near term. However, we can be buyers only if it crosses Rs 1,030 or dips towards Rs 980. In either case, the stop-loss would be Rs 1,000 or Rs 970 respectively. Above Rs 1,030, it will find resistance at Rs 1,070 and Rs 1,100. Ashok Leyland: Sell | LTP: Rs 138 | Stop-Loss: Rs 143 | Target: Rs 128 | Return: 7 percent The stock was forming a descending triangle and the support was at Rs 139, which remained for more than 2 months. Based on the charts, the stock is moving towards the next supports, which are at Rs 131 and Rs 128. The stock is trending down and a breakdown of the formation should generate further bearish momentum in the near term. One can sell at Rs 137 and sell at Rs 140, with a stop-loss at Rs 143. Expert: Jigar S Patel, Senior Manager - Equity Research at Anand Rathi Biocon: Buy | LTP: Rs 267 | Stop-Loss: Rs 250 | Target: Rs 300 | Return: 12 percent On November 21, 2022, the said counter made a high of Rs 295 and since then it started free fall to Rs 259 resulting in a 12 percent cut in price. At the current juncture, Biocon has made a bullish BAT pattern near its historical support of Rs 260 which is also one of the double bottoms formed in recent times with the daily RSI (relative strength index) bullish divergence. Last but not least volume has picked up from lower levels which is a sign of early reversal in the counter. One can buy with an upside target of Rs 300 with plausible support at Rs 250. LTIMindtree: Buy | LTP: Rs 4,266 | Stop-Loss: Rs 4,000 | Target: Rs 4,825 | Return: 13 percent LTIMindtree has observed free fall after registering the top of Rs 5,360 on November 15, 2022, resulting in a 21 percent drop in price. At the current juncture, the said counter has stabilized near Rs 4,250-4,300. On a daily scale, it has made a bullish AB=CD pattern near historical support of Rs 4,250-4,350 along with a Bullish Hammer confirming an early reversal in the counter. Even volume from lower levels is rising further complementing the bullish reversal in the counter. One can buy with an upside target of Rs 4,825 with a stop-loss of Rs 4,000. Glenmark Pharma: Buy | LTP: Rs 429 | Stop-Loss: Rs 400 | Target: Rs 480 | Return: 12 percent Glenmark Pharma has observed a steep fall of 49 percent between July 2021 and June 2022. Since then, the stock has been making higher highs and higher lows structure thus confirming its uptrend. For the last 2 months, the said counter has maintained its price above 200 DEMA (days exponential moving average) HL band (high & low) which is an indication of more strength coming in. On the indicator front, weekly RSI (relative strength index) has taken support near 50 levels and rebounded from there along with weekly MACD (moving average convergence divergence) approaching the zero-line denoting further upside in Glenmark. One can buy in the mentioned above range with an upside expected till Rs 480, with a stop-loss of Rs 400. Expert: Jatin Gohil, Technical and Derivative Research Analyst at Reliance Securities Biocon: Buy | LTP: Rs 267 | Stop-Loss: Rs 258 | Target: Rs 320 | Return: 20 percent The stock formed an indecisive pattern-Doji around its prior swing low of Rs 258 and poised for a bullish reversal. This could take the stock towards Rs 310-320 zone, where its 50-week EMA (exponential moving average) and prior point of polarity are placed. The key technical indicators gave buy signal post bullish divergence. In case of any decline, its prior swing low will restrict the loss. Max Financial Services: Sell | LTP: Rs 671 | Stop-Loss: Rs 710 | Target: Rs 600 | Return: 11 percent The stock oscillated around its short-term supply zone (placed at around Rs 720) and witnessed a range breakdown. This could drag the stock towards its prior swing low (Rs 625) initially and its psychological level (Rs 600) subsequently. Its daily RSI reversed after testing bear market resistance zone (60-67) and witnessed a bearish cross-over. In case of pullback, its downward sloping 20-day and 50-day EMAs will cap the up-move, which are placed at Rs 696 and Rs 707, respectively. Dalmia Bharat: Sell | LTP: Rs 1,770.5 | Stop-Loss: Rs 1,950 | Target: Rs 1,500 | Return: 15 percent The stock faced hurdle around its prior point of polarity and gave bearish reversal confirmation. We believe the stock could move towards its intermediate horizontal trendline, which is placed at around Rs 1,500. Its weekly RSI gave sell signal after testing its bear market resistance zone (60-67). On the higher side, its prior swing high will restrict the rise, which is placed at Rs 1,947. Expert: Rohan Shah, Head of Technical Analyst at Stoxbox Brigade Enterprises: Buy | LTP: Rs 471 | Stop-Loss: Rs 448 | Target: Rs 520 | Return: 10 percent The Primary trend of the stock continue to remain bullish as on the higher time frame chart, stock denoting formation of series of Higher highs and lows. Post printing a life high, price retraced lower to confluence of support and has reversed smartly outperformance the broader market. The stock has dropped to 89 band moving average which coincides with rising trendline support and 61.8 percent retracement levels of its prior advance denoting strong support for the stock. On the lower time frame chart, stock has reversed completing Bullish AB=CD Harmonic pattern with above average volume and wide bullish candle. The RSI inching higher and has entered into the bullish territory denotes strength in price and stock likely to outperform the benchmark index. Zydus Lifesciences: Buy | LTP: Rs 420 | Stop-Loss: Rs 402 | Target: Rs 460 | Return: 9.5 percent In the last couple of days, the Pharma index has relatively outperform the benchmark index, with the absolute pharma index chart has shown strong reversal from the lower end of the rising parallel channel highlighting upside momentum to continue ahead. Earlier stock registered a decisive breakout from multi week consolidation with strong volumes and momentum which signals bullish bias for medium term trend. Price has reversed finding support long and short term average (200 weekly EMA & 20 weekly EMA) highlighting strong support for the stock. The volumes are higher on the up days whereas lower on the down days which denotes strength in trend and robust price action. The RSI have reversed from neutral readings and converging around its average and upward sloping trendline complementing bullish view on price. SBI Card: Sell | LTP: Rs 771 | Stop-Loss: Rs 806 | Target: Rs 700 | Return: 9 percent The stock has been under pressure from last couple of months and in the process stock has broken multiple significant support levels which signals bears dominance likely to continue ahead. The stock has registered breakdown from 61.8 percent retracement level of its prior advance from Rs 656 to Rs 1,028 suggesting weakness to continue and price likely to drop lower to hit 78.6 percent - 88.6 percent retracement level respectively. Since couple of weeks, the stock has been oscillating below its cluster of key moving averages (20-week EMA, 50-week EMA and 100-week EMA) which highlights lack of strength in trend. On the lower time frame chart, stock has witnessed breakdown from Squeeze Bollinger Band which highlights volatility to expand on the downside direction. The key momentum indicators are negatively poised, RSI has surpassed below 40 readings, and MACD has earlier given bearish crossover and currently placed into bearish territory. ", "date": "2022-12-26", "resolved_text": " A host of news such as a spike in Covid cases across several countries, fear of further policy tightening by the Federal Reserve and a growing chance of recession battered the market in the week ended December 23. India's benchmark indices hit near two-month lows as all sectors, barring healthcare, witnessed heavy selling. The BSE Sensex crashed nearly 1,500 points during the week ended December 23 to 59,845, while the Nifty50 tanked 460 points to 17,807, the lowest closing level since October 28. the Nifty50 has formed a long bearish candle on the weekly timeframe with lower highs, lower lows for the second straight week, while on the daily charts, after a sharp gap-down opening, there was also a long bearish candle formation with lower lows, lower highs for the second straight day. the Nifty50 closed near the Nifty50's 50 percent Fib retracement (from 16,747 on September 30 and new high of 18,887 on December 1), which can be crucial level to watch out for the next week. Also the Nifty50 is close to 100 DMA (daily moving average) as well as 100 EMA (exponential moving average) which is around 17,840. All these indicate that 17,800 is expected to be a crucial level in the next week, and considering the RSI (relative strength index) near the oversold zone on the daily charts, the rebound can't be ruled out led by short-covering, experts said. \"Taking a glance at the daily and weekly time-frame charts, we see a cluster of technical evidence. We This expectation the downside will be limited hereon. This expectation will become a reality in the coming sessions,\" Sameet Chavan, Chief Analyst, Technical and Derivatives at Angel One, said. As far as levels are concerned, Sameet Chavan, Chief Analyst, Technical and Derivatives at Angel One, feels 17,900-18,050 are to be seen as the immediate hurdles, and only a close above the upper range would confirm the resumption of an uptrend. On the flipside, an extended correction below 17,750-17,700 would drag the Nifty50 towards the next important support zone of 17,600-17,450, Sameet Chavan, Chief Analyst, Technical and Derivatives at Angel One, said. The broader markets faced intense selling pressure the week ended December 23, with the Nifty Midcap 100 and Smallcap 100 indices declining 5.8 percent and 8.3 percent. Sameet Chavan, Chief Analyst, Technical and Derivatives at Angel One, advised traders to avoid making aggressive bets for a while and wait for the Nifty50 to reclaim 18,050. \"It's an excellent opportunity for investors to start nibbling at quality propositions as most of the counters are significantly off most of the counters's recent highs,\" Sameet Chavan, Chief Analyst, Technical and Derivatives at Angel One, said. Let's take a look at the top 10 trading ideas by experts for the next three-four weeks. Returns are based on the December 23 closing prices: Expert: Shrikant Chouhan, Head of Equity Research (Retail) at Kotak Securities Bank of Baroda: Buy | LTP: Rs 169 | Stop-Loss: Rs 159 | Target: Rs 188 | Return: 11 percent The stock made an all-time high at Rs 197.20, however, later The stock failed to form a higher range which pushed The stock lower. Selling was equally intense and The stock fell to Rs 170, which is The stock's support line based on the Fibonacci retracement. The stock is at 38.20 percent support line. If the weakness extends then The stock will slide towards Rs 160 which will be the support level as per the 50 percent retracement ratio. As the sector is in a bullish trend, we can expect a sharp bounce back if support is found. The strategy should be to buy between Rs 171 and Rs 162, with a stop-loss at Rs 159. Resistance will be Rs 180 and Rs 188. Sun Pharma: Buy | LTP: Rs 1,001 | Stop-Loss: Rs 970 | Target: Rs 1,100 | Return: 10 percent Sun Pharma has completed a corrective pattern at Rs 975 and has reversed sharply on the back of fundamentally positive news flow, which will help Sun Pharma to exhibit a trending move in the near term. However, we can be buyers only if Sun Pharma crosses Rs 1,030 or dips towards Rs 980. In either case, the stop-loss would be Rs 1,000 or Rs 970 respectively. Above Rs 1,030, Sun Pharma will find resistance at Rs 1,070 and Rs 1,100. Ashok Leyland: Sell | LTP: Rs 138 | Stop-Loss: Rs 143 | Target: Rs 128 | Return: 7 percent Ashok Leyland was forming a descending triangle and the support was at Rs 139, which remained for more than 2 months. Based on the charts, Ashok Leyland is moving towards the next supports, which are at Rs 131 and Rs 128. Ashok Leyland is trending down and a breakdown of the formation should generate further bearish momentum in the near term. One can sell at Rs 137 and sell at Rs 140, with a stop-loss at Rs 143. Expert: Jigar S Patel, Senior Manager - Equity Research at Anand Rathi Biocon: Buy | LTP: Rs 267 | Stop-Loss: Rs 250 | Target: Rs 300 | Return: 12 percent On November 21, 2022, the said counter made a high of Rs 295 and since then the said counter started free fall to Rs 259 resulting in a 12 percent cut in price. At the current juncture, Biocon has made a bullish BAT pattern near Biocon's historical support of Rs 260 which is also one of the double bottoms formed in recent times with the daily RSI (relative strength index) bullish divergence. Last but not least volume has picked up from lower levels which is a sign of early reversal in the said counter. One can buy with an upside target of Rs 300 with plausible support at Rs 250. LTIMindtree: Buy | LTP: Rs 4,266 | Stop-Loss: Rs 4,000 | Target: Rs 4,825 | Return: 13 percent LTIMindtree has observed free fall after registering the top of Rs 5,360 on November 15, 2022, resulting in a 21 percent drop in price. At the current juncture, the said counter has stabilized near Rs 4,250-4,300. On a daily scale, the said counter has made a bullish AB=CD pattern near historical support of Rs 4,250-4,350 along with a Bullish Hammer confirming an early reversal in the said counter. Even volume from lower levels is rising further complementing the bullish reversal in the said counter. One can buy with an upside target of Rs 4,825 with a stop-loss of Rs 4,000. Glenmark Pharma: Buy | LTP: Rs 429 | Stop-Loss: Rs 400 | Target: Rs 480 | Return: 12 percent Glenmark Pharma has observed a steep fall of 49 percent between July 2021 and June 2022. Since then, Glenmark Pharma has been making higher highs and higher lows structure thus confirming Glenmark Pharma's uptrend. For the last 2 months, the said counter has maintained the said counter's price above 200 DEMA (days exponential moving average) HL band (high & low) which is an indication of more strength coming in. On the indicator front, weekly RSI (relative strength index) has taken support near 50 levels and rebounded from there along with weekly MACD (moving average convergence divergence) approaching the zero-line denoting further upside in Glenmark Pharma. One can buy in the mentioned above range with an upside expected till Rs 480, with a stop-loss of Rs 400. Expert: Jatin Gohil, Technical and Derivative Research Analyst at Reliance Securities Biocon: Buy | LTP: Rs 267 | Stop-Loss: Rs 258 | Target: Rs 320 | Return: 20 percent The stock formed an indecisive pattern-Doji around The stock's prior swing low of Rs 258 and poised for a bullish reversal. a bullish reversal could take The stock towards Rs 310-320 zone, where The stock's 50-week EMA (exponential moving average) and prior point of polarity are placed. The key technical indicators gave buy signal post bullish divergence. In case of any decline, The stock's prior swing low will restrict the loss. Max Financial Services: Sell | LTP: Rs 671 | Stop-Loss: Rs 710 | Target: Rs 600 | Return: 11 percent The stock oscillated around The stock's short-term supply zone (placed at around Rs 720) and witnessed a range breakdown. a range breakdown could drag The stock towards The stock's prior swing low (Rs 625) initially and The stock's psychological level (Rs 600) subsequently. The stock's daily RSI reversed after testing bear market resistance zone (60-67) and witnessed a bearish cross-over. In case of pullback, The stock's downward sloping 20-day and 50-day EMAs will cap the up-move, which are placed at Rs 696 and Rs 707, respectively. Dalmia Bharat: Sell | LTP: Rs 1,770.5 | Stop-Loss: Rs 1,950 | Target: Rs 1,500 | Return: 15 percent Dalmia Bharat faced hurdle around Dalmia Bharat's prior point of polarity and gave bearish reversal confirmation. We believe Dalmia Bharat could move towards Dalmia Bharat's intermediate horizontal trendline, which is placed at around Rs 1,500. The stock's weekly RSI gave sell signal after testing The stock's bear market resistance zone (60-67). On the higher side, The stock's prior swing high will restrict the rise, which is placed at Rs 1,947. Expert: Rohan Shah, Head of Technical Analyst at Stoxbox Brigade Enterprises: Buy | LTP: Rs 471 | Stop-Loss: Rs 448 | Target: Rs 520 | Return: 10 percent The Primary trend of The stock continue to remain bullish as on the higher time frame chart, stock denoting formation of series of Higher highs and lows. Post printing a life high, price retraced lower to confluence of support and has reversed smartly outperformance the broader market. The stock has dropped to 89 band moving average which coincides with rising trendline support and 61.8 percent retracement levels of The stock's prior advance denoting strong support for The stock. On the lower time frame chart, The stock has reversed completing Bullish AB=CD Harmonic pattern with above average volume and wide bullish candle. The RSI inching higher and has entered into the bullish territory denotes strength in price and stock likely to outperform the benchmark index. Zydus Lifesciences: Buy | LTP: Rs 420 | Stop-Loss: Rs 402 | Target: Rs 460 | Return: 9.5 percent In the last couple of days, the Pharma index has relatively outperform the benchmark index, with the absolute pharma index chart has shown strong reversal from the lower end of the rising parallel channel highlighting upside momentum to continue ahead. Earlier stock registered a decisive breakout from multi week consolidation with strong volumes and momentum which signals bullish bias for medium term trend. Price has reversed finding support long and short term average (200 weekly EMA & 20 weekly EMA) highlighting strong support for The stock. The volumes are higher on the up days whereas lower on the down days which denotes strength in trend and robust price action. The RSI have reversed from neutral readings and converging around The RSI's average and upward sloping trendline complementing bullish view on price. SBI Card: Sell | LTP: Rs 771 | Stop-Loss: Rs 806 | Target: Rs 700 | Return: 9 percent The stock has been under pressure from last couple of months and in the process The stock has broken multiple significant support levels which signals bears dominance likely to continue ahead. The stock has registered breakdown from 61.8 percent retracement level of The stock's prior advance from Rs 656 to Rs 1,028 suggesting weakness to continue and price likely to drop lower to hit 78.6 percent - 88.6 percent retracement level respectively. Since couple of weeks, The stock has been oscillating below The stock's cluster of key moving averages (20-week EMA, 50-week EMA and 100-week EMA) which highlights lack of strength in trend. On the lower time frame chart, The stock has witnessed breakdown from Squeeze Bollinger Band which highlights volatility to expand on the downside direction. The key momentum indicators are negatively poised, The RSI has surpassed below 40 readings, and MACD has earlier given bearish crossover and currently placed into bearish territory. ", "sentiment_score": 0.0, "sentiment_class": "Neutral", "sentiment_class_value": 0}, {"_id": {"$oid": "63af365637c41e98a35400ad"}, "url": "https://economictimes.indiatimes.com/wealth/invest/axis-focused-25-mutual-fund-review-not-flavour-of-the-moment/articleshow/96470789.cms?edition=96473775", "title": "Axis Focused 25 mutual fund review: Not flavour of the moment", "datetime": "2022-12-26 06:30", "content": "ET Wealth collaborates with Value Research to analyse top mutual funds. We examine the key fundamentals of the fund, its portfolio and performance to help you make an informed investment decision. 29 JUNE 2012 EQUITY FLEXI CAP Rs.17,894 Crore NIFTY 500 TOTAL RETURN INDEX Rs.40.13 Rs.19.15 Rs.500 Rs.100 1.75 For units in excess of 10% of the investment,1% will be charged for redemption within 365 days JINESH GOPANI TENURE: 6 YEARS, 5 MONTHS LTIMindtree. Samvardhana Motherson International, MindTree. PI Industries , Sona BLW Precision Forgings (Oct), Apollo Hospitals Enterprise , Asian Paints , Motherson Sumi Wiring India , Pidilite Industries , Reliance Industries , Tata Consultancy Services (Nov). The funds runs a focused approach, comprising a highly compact portfolio of the fund manager's highest conviction bets. It features a distinct large cap bias with the fund manager comfortable paying a premium for select stocks that fit within its strict quality and growth framework. The fund boasts an impressive long term track record, but has sagged in recent years. After putting in consistent outperformance through 2017-20, it has seen two years of severe underperformance. The market's shifting preferences towards value has left its growth-led engine cold. While the fund manager has proven execution capabilities, woes may persist till climate turns favourable for growth style. (Source: Value Research) ", "date": "2022-12-26", "resolved_text": "ET Wealth collaborates with Value Research to analyse top mutual funds. ET Wealth examine the key fundamentals of the fund, the fund's portfolio and performance to help you make an informed investment decision. 29 JUNE 2012 EQUITY FLEXI CAP Rs.17,894 Crore NIFTY 500 TOTAL RETURN INDEX Rs.40.13 Rs.19.15 Rs.500 Rs.100 1.75 For units in excess of 10% of the investment,1% will be charged for redemption within 365 days JINESH GOPANI TENURE: 6 YEARS, 5 MONTHS LTIMindtree. Samvardhana Motherson International, MindTree. PI Industries , Sona BLW Precision Forgings (Oct), Apollo Hospitals Enterprise , Asian Paints , Motherson Sumi Wiring India , Pidilite Industries , Reliance Industries , Tata Consultancy Services (Nov). EQUITY FLEXI runs a focused approach, comprising a highly compact portfolio of the fund manager's's highest conviction bets. a focused approach features a distinct large cap bias with the fund manager's comfortable paying a premium for select stocks that fit within a focused approach's strict quality and growth framework. EQUITY FLEXI boasts an impressive long term track record, but has sagged in recent years. After putting in consistent outperformance through 2017-20, EQUITY FLEXI has seen two years of severe underperformance. The market's shifting preferences towards value has left EQUITY FLEXI's growth-led engine cold. While the fund manager has proven execution capabilities, woes may persist till climate turns favourable for growth style. (Source: Value Research) ", "sentiment_score": -1.0, "sentiment_class": "Negative", "sentiment_class_value": -2}, {"_id": {"$oid": "63af368c37c41e98a35400b5"}, "url": "https://economictimes.indiatimes.com/mf/analysis/axis-focused-25-mutual-fund-review-not-flavour-of-the-moment/mf/analysis/axis-focused-25-mutual-fund-review-not-flavour-of-the-moment/articleshow/96507772.cms", "title": "Axis Focused 25 Fund: Fund Review", "datetime": "2022-12-26 06:30", "content": "ET Wealth collaborates with Value Research to analyse top mutual funds. We examine the key fundamentals of the fund, its portfolio and performance to help you make an informed investment decision. 29 JUNE 2012 EQUITY FLEXI CAP Rs.17,894 Crore NIFTY 500 TOTAL RETURN INDEX Rs.40.13 Rs.19.15 Rs.500 Rs.100 1.75 For units in excess of 10% of the investment,1% will be charged for redemption within 365 days JINESH GOPANI TENURE: 6 YEARS, 5 MONTHS LTIMindtree. Samvardhana Motherson International, MindTree. PI Industries , Sona BLW Precision Forgings (Oct), Apollo Hospitals Enterprise , Asian Paints , Motherson Sumi Wiring India , Pidilite Industries , Reliance Industries , Tata Consultancy Services (Nov). The funds runs a focused approach, comprising a highly compact portfolio of the fund manager's highest conviction bets. It features a distinct large cap bias with the fund manager comfortable paying a premium for select stocks that fit within its strict quality and growth framework. The fund boasts an impressive long term track record, but has sagged in recent years. After putting in consistent outperformance through 2017-20, it has seen two years of severe underperformance. The market's shifting preferences towards value has left its growth-led engine cold. While the fund manager has proven execution capabilities, woes may persist till climate turns favourable for growth style. (Source: Value Research) ", "date": "2022-12-26", "resolved_text": "ET Wealth collaborates with Value Research to analyse top mutual funds. ET Wealth examine the key fundamentals of the fund, the fund's portfolio and performance to help you make an informed investment decision. 29 JUNE 2012 EQUITY FLEXI CAP Rs.17,894 Crore NIFTY 500 TOTAL RETURN INDEX Rs.40.13 Rs.19.15 Rs.500 Rs.100 1.75 For units in excess of 10% of the investment,1% will be charged for redemption within 365 days JINESH GOPANI TENURE: 6 YEARS, 5 MONTHS LTIMindtree. Samvardhana Motherson International, MindTree. PI Industries , Sona BLW Precision Forgings (Oct), Apollo Hospitals Enterprise , Asian Paints , Motherson Sumi Wiring India , Pidilite Industries , Reliance Industries , Tata Consultancy Services (Nov). EQUITY FLEXI runs a focused approach, comprising a highly compact portfolio of the fund manager's's highest conviction bets. a focused approach features a distinct large cap bias with the fund manager's comfortable paying a premium for select stocks that fit within a focused approach's strict quality and growth framework. EQUITY FLEXI boasts an impressive long term track record, but has sagged in recent years. After putting in consistent outperformance through 2017-20, EQUITY FLEXI has seen two years of severe underperformance. The market's shifting preferences towards value has left EQUITY FLEXI's growth-led engine cold. While the fund manager has proven execution capabilities, woes may persist till climate turns favourable for growth style. (Source: Value Research) ", "sentiment_score": -1.0, "sentiment_class": "Negative", "sentiment_class_value": -2}, {"_id": {"$oid": "63af36ccc66f1e9c2e1ab4d9"}, "url": "https://economictimes.indiatimes.com/mf/analysis/axis-focused-25-mutual-fund-review-not-flavour-of-the-moment/articleshow/96507772.cms", "title": "Axis Focused 25 Fund: Fund Review", "datetime": "2022-12-26 06:30", "content": "ET Wealth collaborates with Value Research to analyse top mutual funds. We examine the key fundamentals of the fund, its portfolio and performance to help you make an informed investment decision. 29 JUNE 2012 EQUITY FLEXI CAP Rs.17,894 Crore NIFTY 500 TOTAL RETURN INDEX Rs.40.13 Rs.19.15 Rs.500 Rs.100 1.75 For units in excess of 10% of the investment,1% will be charged for redemption within 365 days JINESH GOPANI TENURE: 6 YEARS, 5 MONTHS LTIMindtree. Samvardhana Motherson International, MindTree. PI Industries , Sona BLW Precision Forgings (Oct), Apollo Hospitals Enterprise , Asian Paints , Motherson Sumi Wiring India , Pidilite Industries , Reliance Industries , Tata Consultancy Services (Nov). The funds runs a focused approach, comprising a highly compact portfolio of the fund manager's highest conviction bets. It features a distinct large cap bias with the fund manager comfortable paying a premium for select stocks that fit within its strict quality and growth framework. The fund boasts an impressive long term track record, but has sagged in recent years. After putting in consistent outperformance through 2017-20, it has seen two years of severe underperformance. The market's shifting preferences towards value has left its growth-led engine cold. While the fund manager has proven execution capabilities, woes may persist till climate turns favourable for growth style. (Source: Value Research) ", "date": "2022-12-26", "resolved_text": "ET Wealth collaborates with Value Research to analyse top mutual funds. ET Wealth examine the key fundamentals of the fund, the fund's portfolio and performance to help you make an informed investment decision. 29 JUNE 2012 EQUITY FLEXI CAP Rs.17,894 Crore NIFTY 500 TOTAL RETURN INDEX Rs.40.13 Rs.19.15 Rs.500 Rs.100 1.75 For units in excess of 10% of the investment,1% will be charged for redemption within 365 days JINESH GOPANI TENURE: 6 YEARS, 5 MONTHS LTIMindtree. Samvardhana Motherson International, MindTree. PI Industries , Sona BLW Precision Forgings (Oct), Apollo Hospitals Enterprise , Asian Paints , Motherson Sumi Wiring India , Pidilite Industries , Reliance Industries , Tata Consultancy Services (Nov). EQUITY FLEXI runs a focused approach, comprising a highly compact portfolio of the fund manager's's highest conviction bets. a focused approach features a distinct large cap bias with the fund manager's comfortable paying a premium for select stocks that fit within a focused approach's strict quality and growth framework. EQUITY FLEXI boasts an impressive long term track record, but has sagged in recent years. After putting in consistent outperformance through 2017-20, EQUITY FLEXI has seen two years of severe underperformance. The market's shifting preferences towards value has left EQUITY FLEXI's growth-led engine cold. While the fund manager has proven execution capabilities, woes may persist till climate turns favourable for growth style. (Source: Value Research) ", "sentiment_score": -1.0, "sentiment_class": "Negative", "sentiment_class_value": -2}, {"_id": {"$oid": "63af4e0b37c41e98a354043b"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-nifty-it-index-advances-0-53/articleshow/96516962.cms", "title": "Stock market update: Nifty IT index advances 0.53%", "datetime": "2022-12-26 16:00", "content": "NEW DELHI: The Nifty IT index closed on a positive note on Monday. Shares of LTIMindtree Ltd(up 1.79 per cent), Coforge(up 1.35 per cent), Tata Consultancy(up 1.05 per cent), Tech Mahindra(up 0.67 per cent) and Wipro(up 0.62 per cent) ended the day as top gainers in the pack. On the other hand, Persistent Systems(down 0.58 per cent) and MPhasis(down 0.16 per cent) finished as the top losers of the day. The Nifty IT index closed 0.53 per cent up at 28385.7. Benchmark NSE Nifty50 index ended up 207.8 points at 18014.6, while the BSE Sensex stood up 721.13 points at 60566.42. Among the 50 stocks in the Nifty index, 38 ended in the green, while 11 closed in the red. Shares of , , IOB, PNB and were among the most traded shares on the NSE. Shares of , , , and Vasa Retail & Overse hit their fresh 52-week highs in today's trade, while , Abans Holdings Ltd., , and Transwarr Fin(PP)hit their fresh 52-week lows. ", "date": "2022-12-26", "resolved_text": "NEW DELHI: The Nifty IT index closed on a positive note on Monday. Shares of LTIMindtree Ltd(up 1.79 per cent), Coforge(up 1.35 per cent), Tata Consultancy(up 1.05 per cent), Tech Mahindra(up 0.67 per cent) and Wipro(up 0.62 per cent) ended Monday as top gainers in the pack. On the other hand, Persistent Systems(down 0.58 per cent) and MPhasis(down 0.16 per cent) finished as the top losers of Monday. The Nifty IT index closed 0.53 per cent up at 28385.7. Benchmark NSE Nifty50 index ended up 207.8 points at 18014.6, while the BSE Sensex stood up 721.13 points at 60566.42. Among the 50 stocks in The Nifty IT index, 38 ended in the green, while 11 closed in the red. Shares of , , IOB, PNB and were among the most traded shares on NSE. Shares of , , , and Vasa Retail & Overse hit Shares of , , , and Vasa Retail & Overse's fresh 52-week highs in today's trade, while , Abans Holdings Ltd., , and Transwarr Fin(PP)hit their fresh 52-week lows. ", "sentiment_score": 1.0, "sentiment_class": "Positive", "sentiment_class_value": 2}, {"_id": {"$oid": "63afcc3737c41e98a35416be"}, "url": "https://economictimes.indiatimes.com/wealth/invest/axis-focused-25-mutual-fund-review-not-flavour-of-the-moment/articleshow/96470789.cms", "title": "Axis Focused 25 mutual fund review: Not flavour of the moment", "datetime": "2022-12-26 06:30", "content": "ET Wealth collaborates with Value Research to analyse top mutual funds. We examine the key fundamentals of the fund, its portfolio and performance to help you make an informed investment decision. 29 JUNE 2012 EQUITY FLEXI CAP Rs.17,894 Crore NIFTY 500 TOTAL RETURN INDEX Rs.40.13 Rs.19.15 Rs.500 Rs.100 1.75 For units in excess of 10% of the investment,1% will be charged for redemption within 365 days JINESH GOPANI TENURE: 6 YEARS, 5 MONTHS LTIMindtree. Samvardhana Motherson International, MindTree. PI Industries , Sona BLW Precision Forgings (Oct), Apollo Hospitals Enterprise , Asian Paints , Motherson Sumi Wiring India , Pidilite Industries , Reliance Industries , Tata Consultancy Services (Nov). The funds runs a focused approach, comprising a highly compact portfolio of the fund manager's highest conviction bets. It features a distinct large cap bias with the fund manager comfortable paying a premium for select stocks that fit within its strict quality and growth framework. The fund boasts an impressive long term track record, but has sagged in recent years. After putting in consistent outperformance through 2017-20, it has seen two years of severe underperformance. The market's shifting preferences towards value has left its growth-led engine cold. While the fund manager has proven execution capabilities, woes may persist till climate turns favourable for growth style. (Source: Value Research) ", "date": "2022-12-26", "resolved_text": "ET Wealth collaborates with Value Research to analyse top mutual funds. ET Wealth examine the key fundamentals of the fund, the fund's portfolio and performance to help you make an informed investment decision. 29 JUNE 2012 EQUITY FLEXI CAP Rs.17,894 Crore NIFTY 500 TOTAL RETURN INDEX Rs.40.13 Rs.19.15 Rs.500 Rs.100 1.75 For units in excess of 10% of the investment,1% will be charged for redemption within 365 days JINESH GOPANI TENURE: 6 YEARS, 5 MONTHS LTIMindtree. Samvardhana Motherson International, MindTree. PI Industries , Sona BLW Precision Forgings (Oct), Apollo Hospitals Enterprise , Asian Paints , Motherson Sumi Wiring India , Pidilite Industries , Reliance Industries , Tata Consultancy Services (Nov). EQUITY FLEXI runs a focused approach, comprising a highly compact portfolio of the fund manager's's highest conviction bets. a focused approach features a distinct large cap bias with the fund manager's comfortable paying a premium for select stocks that fit within a focused approach's strict quality and growth framework. EQUITY FLEXI boasts an impressive long term track record, but has sagged in recent years. After putting in consistent outperformance through 2017-20, EQUITY FLEXI has seen two years of severe underperformance. The market's shifting preferences towards value has left EQUITY FLEXI's growth-led engine cold. While the fund manager has proven execution capabilities, woes may persist till climate turns favourable for growth style. (Source: Value Research) ", "sentiment_score": -1.0, "sentiment_class": "Negative", "sentiment_class_value": -2}], "2022-12-22": [{"_id": {"$oid": "63af25349ef48667cfe935fe"}, "url": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-what-should-you-do-with-glenmark-pharma-biocon-ltimindtree-on-thursday-9744211.html", "title": "Trade Spotlight | What should you do with Glenmark Pharma, Biocon, LTIMindtree on Thursday?", "datetime": "2022-12-22 06:49", "content": " The market faced severe selling pressure with the benchmark indices falling 1 percent on December 21, weighed down by global recession fears and worries over rising Covid cases globally. The BSE Sensex plunged more than 600 points to 61,067, while the Nifty50 jumped nearly 190 points to 18,199 and formed Bearish Engulfing candlestick pattern on the daily charts, indicating bears tightened control over Dalal Street. The similar trend was also seen in broader markets as the Nifty Midcap 100 and Smallcap 100 indices fell 1.6 percent and 2.2 percent respectively. India VIX, the fear index jumped 13 percent to 15.56 level, from 13.78 level, making the trend more favourable for bears. Stocks that were in action and bucked the trend on disappointing day included Glenmark Pharma which was the biggest gainer in the futures and options segment, rising nearly 8 percent to Rs 440 and formed robust bullish Engulfing candlestick pattern on the daily charts with healthy volumes. In fact, the bullish candle was so strong that it engulfed previous four negative candles. The stock has seen a breakout of two horizontal resistance trend lines adjoining November 15 and December 16, as well as November 11 and December 19. Biocon shares gained 3.5 percent at Rs 271 and formed long bullish candle on the daily charts with robust volumes. Also there was Morning Star kind of pattern formation, which is generally called as a bullish reversal pattern formed in an downtrend. LTIMindtree was also in focus, rising 1.4 percent to Rs 4,424 and formed decent bullish candle on the daily charts with above average volumes. The stock has seen a breakout after consolidation in previous three straight days. Also there was a breakout of two horizontal resistance trend lines adjoining December 13 and December 19, as well as December 12 and December 16, while it has seen a breakout of downward sloping resistance trend lines adjoining December 14 and December 20, this year. Here's what Jigar S Patel of Anand Rathi Shares & Stock Brokers recommends investors should do with these stocks when the market resumes trading today: Glenmark Pharma Glenmark Pharma has observed a steep fall of 49 percent between July 2021 and June 2022. Since then the stock has been making higher highs and higher lows structure thus confirming its uptrend. For the last 2 months, the said counter has maintained its price above 200 DEMA (days exponential moving average) OHLC (open high low close) band which is an indication of more strength coming in. On the indicator front, weekly RSI (relative strength index) has taken support near 50 levels and rebounded from there along with weekly MACD (moving average convergence divergence) approaching the zero line denoting further upside in Glenmark. One can buy at current market price (Rs 440) with upside expected till Rs 500, with a stop-loss of Rs 410. Biocon On November 21, 2022 the said counter made a high of Rs 295 and since then it started free fall to Rs 259 resulting in a 12 percent cut in price. At the current juncture, Biocon has made a bullish BAT pattern near its historical support of Rs 260 which is also one of the double bottoms formed in recent times with the daily RSI bullish divergence. Last but not least volume has picked up from lower levels which is a sign of early reversal in the counter. One can immediately buy at current market price (Rs 271) with an upside target of Rs 300 with plausible support at Rs 256. LTIMindtree LTIMindtree has observed free fall after registering the top of Rs 5,360 on November 15, 2022 resulting in a 21 percent drop in price. At the current juncture, the said counter has stabilized near Rs 4,300 mark. On a daily scale, it has made a bullish AB=CD pattern near historical support of Rs 4,250-4,350 along with a Bullish Hammer confirming an early reversal in the counter. Even volume from lower levels is rising further complementing the bullish reversal in the counter. (refer to the chart) One can buy with an upside target of Rs 4,700 with a stop-loss of Rs 4,288. ", "date": "2022-12-22", "resolved_text": " The market faced severe selling pressure with the benchmark indices falling 1 percent on December 21, weighed down by global recession fears and worries over rising Covid cases globally. The BSE Sensex plunged more than 600 points to 61,067, while the Nifty50 jumped nearly 190 points to 18,199 and formed Bearish Engulfing candlestick pattern on the daily charts, indicating bears tightened control over Dalal Street. The similar trend was also seen in broader markets as the Nifty Midcap 100 and Smallcap 100 indices fell 1.6 percent and 2.2 percent respectively. India VIX, the fear index jumped 13 percent to 15.56 level, from 13.78 level, making the trend more favourable for bears. Stocks that were in action and bucked the trend on December 21 included Glenmark Pharma which was the biggest gainer in the futures and options segment, rising nearly 8 percent to Rs 440 and formed robust bullish Engulfing candlestick pattern on the daily charts with healthy volumes. In fact, robust bullish Engulfing candlestick pattern on the daily charts with healthy volumes was so strong that robust bullish Engulfing candlestick pattern on the daily charts with healthy volumes engulfed previous four negative candles. The stock has seen a breakout of two horizontal resistance trend lines adjoining November 15 and December 16, as well as November 11 and December 19. Biocon shares gained 3.5 percent at Rs 271 and formed long bullish candle on the daily charts with robust volumes. Also there was Morning Star kind of pattern formation, which is generally called as a bullish reversal pattern formed in an downtrend. LTIMindtree was also in focus, rising 1.4 percent to Rs 4,424 and formed decent bullish candle on the daily charts with above average volumes. LTIMindtree has seen a breakout after consolidation in previous three straight days. Also there was a breakout of two horizontal resistance trend lines adjoining December 13 and December 19, as well as December 12 and December 16, while The stock has seen a breakout of downward sloping resistance trend lines adjoining December 14 and December 20, this year. Here's what Jigar S Patel of Anand Rathi Shares & Stock Brokers recommends investors should do with these stocks when The market resumes trading today: Glenmark Pharma Glenmark Pharma has observed a steep fall of 49 percent between July 2021 and June 2022. Since then The stock has been making higher highs and higher lows structure thus confirming The stock's uptrend. For the last 2 months, The stock has maintained The stock's price above 200 DEMA (days exponential moving average) OHLC (open high low close) band which is an indication of more strength coming in. On the indicator front, weekly RSI (relative strength index) has taken support near 50 levels and rebounded from there along with weekly MACD (moving average convergence divergence) approaching the zero line denoting further upside in Glenmark Pharma. One can buy at current market price (Rs 440) with upside expected till Rs 500, with a stop-loss of Rs 410. Biocon On November 21, 2022 The stock made a high of Rs 295 and since then The stock started free fall to Rs 259 resulting in a 12 percent cut in price. At the current juncture, Biocon has made a bullish BAT pattern near Biocon's historical support of Rs 260 which is also one of the double bottoms formed in recent times with the daily RSI bullish divergence. Last but not least volume has picked up from lower levels which is a sign of early reversal in The stock. One can immediately buy at current market price (Rs 271) with an upside target of Rs 300 with plausible support at Rs 256. LTIMindtree LTIMindtree has observed free fall after registering the top of Rs 5,360 on November 15, 2022 resulting in a 21 percent drop in price. At the current juncture, The stock has stabilized near Rs 4,300 mark. On a daily scale, The stock has made a bullish AB=CD pattern near historical support of Rs 4,250-4,350 along with a Bullish Hammer confirming an early reversal in The stock. Even volume from lower levels is rising further complementing the bullish reversal in The stock. (refer to the chart) One can buy with an upside target of Rs 4,700 with a stop-loss of Rs 4,288. ", "sentiment_score": 0.19, "sentiment_class": "Slightly Positive", "sentiment_class_value": 1}, {"_id": {"$oid": "63af2d189ef48667cfe93ba1"}, "url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-thursday-top-15-things-to-know-before-the-opening-bell-18-9743881.html", "title": "Trade setup for today: Top 15 things to know before the opening bell", "datetime": "2022-12-22 08:26", "content": " The market extended losses to settle at a one-month low on December 21 amid a surge in COVID-19 cases globally. That apart, fear of recession and selling by FIIs, too, put pressure on the market. All sectors, barring pharma and IT, closed in the red. The BSE Sensex plunged 635 points or 1 percent to 61,067, while the Nifty50 plummeted 186 points to 18,199 and formed a Bearish Engulfing candle pattern on the daily charts, indicating more weakness in the market going ahead. \"On the daily charts, the Nifty formed a Bearish Engulfing candle pattern which is a bearish reversal pattern. However, the Nifty managed to sustain above important support of 18,130 level,\" Vidnyan Sawant, AVP - Technical Research at GEPL Capital said. The momentum indicator RSI (relative strength index) is moving below the 45 level which indicates a lack of momentum of the index. The Nifty has an immediate resistance level placed at 18,300 (key resistance) followed by 18,440 (multiple touch point) and on the other side, it has a strong support level placed at 18,130 (key support) followed by 17,959 (key support). As per the overall price structure and evidence provided by indicators, the market expert feels that the Nifty will move towards 18,130 followed by 17,959 levels. If the Nifty sustains above the 18,545 level then the corrective view will be negated, he said. The broader markets saw more correction than benchmarks on weak breadth. The Nifty Midcap 100 index tanked 1.6 percent while the Smallcap 100 index slumped 2.2 percent as nearly six shares declined for every one advancing share on the NSE. The volatility also increased sharply, hence making the bulls uncomfortable. India VIX, the fear index, rose by 12.93 percent to 15.56 levels. We have collated 15 data points to help you spot profitable trades: Note: The open interest (OI) and volume data of stocks in this article are the aggregates of three-month data, and not just of the current month. Key support and resistance levels on the Nifty As per the pivot charts, the key support level for the Nifty is placed at 18,160, followed by 18,086 & 17,968. If the index moves up, the key resistance levels to watch out for are 18,397 followed by 18,470 and 18,589. Nifty Bank The Nifty Bank also saw major selling pressure and has broken the crucial support of the 43,000 mark. The banking index fell 742 points to close at 42,618 and formed a Bearish Engulfing candlestick pattern on the daily charts. The important pivot level, which will act as crucial support for the index, is placed at 42,388, followed by 42,092 and 41,615 levels. On the upside, key resistance levels are placed at 43,343 followed by 43,638 & 44,116 levels. CALL OPTION DATA We have seen the maximum Call open interest at 18,500 strike, with 51.31 lakh contracts, which can act as a crucial resistance level in the December series. This is followed by 19,000 strike, which holds 37.14 lakh contracts, and 18,600 strike, which have more than 35.54 lakh contracts. Call writing was seen at 18,500 strike, which added 14.83 lakh contracts, followed by 18,600 strike, which added 6.53 lakh contracts, and 18,200 strike which added 5.37 lakh contracts. Call unwinding was seen at 18,800 strike, which shed 2.22 lakh contracts, followed by 19,200 strike which shed 1.25 lakh contracts and 19,600 strike which shed 50,200 contracts. PUT OPTION DATA We have seen a maximum Put open interest at 18,000 strike, with 47.84 lakh contracts which can act as a crucial support level in the December series. This is followed by an 18,300 strike, which holds 36.06 lakh contracts, and a 17,500 strike, which has accumulated 32.17 lakh contracts. Put writing was seen at 18,000 strike, which added 6.25 lakh contracts, followed by 17,800 strike, which added 4.82 lakh contracts and 18,100 strike which added 2.44 lakh contracts. Put unwinding was seen at 18,300 strike, which shed 6.43 lakh contracts, followed by 18,400 strike which shed 2.66 lakh contracts, and 18,700 strike which shed 49,950 contracts. Stocks with a high delivery percentage A high delivery percentage suggests that investors are showing interest in these stocks. We have seen the highest delivery in Torrent Pharma, Oracle Financial, Voltas, Samvardhana Motherson International, and Infosys, among others. 9 stocks saw long build-up An increase in open interest, along with an increase in price, mostly indicates a build-up of long positions. Based on the open interest future percentage, we have seen a long build-up in the total of nine stocks on Wednesday, including Torrent Pharma, Ipca Laboratories, Glenmark Pharma, Cipla, and Dr Lal PathLabs. 94 stocks saw long unwinding A decline in open interest, along with a decrease in price, mostly indicates a long unwinding. Based on the open interest future percentage, a total of 94 stocks have seen long unwinding on Wednesday including Chambal Fertilizers, Dalmia Bharat, Delta Corp, Punjab National Bank, and Persistent Systems. 63 stocks saw short build-up An increase in open interest, along with a decrease in price, mostly indicates a build-up of short positions. Based on the open interest future percentage, we have seen a short build-up in a total of 63 stocks on Wednesday including LIC Housing Finance, Max Financial Services, Nifty Financial, City Union Bank, and Dixon Technologies. 29 stocks witnessed short-covering A decrease in open interest, along with an increase in price, mostly indicates a short-covering. Based on the open interest future percentage, we have a total of 29 stocks in the short-covering list on Wednesday including Metropolis Healthcare, LTIMindtree, Syngene International, Biocon, and Lupin. Bulk Deals D-Link India: Ace investor Ashish Kacholia sold 2.13 lakh shares (0.6 percent) in the company via open market transactions, at an average price of Rs 242.56 per share. He had held a 3.34 percent stake or 11.86 lakh shares in the company as of September 2022. Max Financial Services: Max Ventures Investment Holdings sold 58.85 lakh shares (1.7 percent) in the company via open market transactions at an average price of Rs 679.2 per share. The stake sale was worth Rs 400 crore. (For more bulk deals, click here) Investors Meetings on December 22 Greaves Cotton: Officials of company will interact with HDFC Securities. Tata Motors: Officials of the company will interact with Aspex Management (HK), Motilal Oswal Mutual, and HDFC MF. Blue Star: Officials of the company will interact with ICICI Prudential AMC. Havells India, Kaynes Technology India: Officials of companies will participate in PhillipCapital \"Manufacturing Day - From Make-in-India to Make-For-The-World\" in Delhi. Tata Consumer Products: Officials of the company will interact with GIC. CE Info Systems: Officials of the company will interact with LIC MF. CARE Ratings: Officials of the company will interact with O3 Capital, and Securities Investment Management. Indian Bank: Officials of the bank will interact with analysts and investors. Polycab India: Officials of the company will interact with Macquarie Capital. Sapphire Foods India: Officials of the company will interact with Nuvama (Edelweiss), Hara Global Capital Management, Ambit Capital, and HDFC Securities. Ircon International: Management of the company will meet Grace Yan, Portfolio Manager at Nikko Asset Management. Stocks in News Sula Vineyards: India's largest wine producer will make its debut on the bourses on December 22. The issue price has been fixed at Rs 357 per share. JMC Projects (India): The National Company Law Tribunal has sanctioned the Scheme of Amalgamation of the company with Kalpataru Power Transmission. Speciality Restaurants: The company has received board approval for issue of 60 lakh warrants convertible into equity shares on preferential basis, at a price of Rs 212.05 per warrant. An amount equivalent to 25% of the warrant issue price (i.e. Rs 53.02 per warrant) will be payable at the time of subscription and allotment of each warrant, and the balance 75% of the warrant issue price (Rs 159.03 per warrant) will be payable on the exercise of warrants on or before April 30, 2023. JB Chemicals & Pharmaceuticals: The private equity firm KKR-backed JB Chemicals has completed acquisition of Razel franchise from Glenmark Pharmaceuticals. Last week, As a result, it had agreed to acquire Glenmark's cardiac brand Razel in India and Nepal for Rs 313.7 crore. Supriya Lifescience: The company has signed an agreement with Pune-based Enrich Energy to develop 4.68 MWp DC solar photovoltaic power project at Nanded in Maharashtra. This project will generate & supply green energy to fulfill about 50 percent present consumption of the company & reduce carbon emission equivalent to 6,830 tons per annum. Lyka Labs: The company has signed an agreement to acquire animal healthcare business from Agilis Healthcare. In November, it had proposed acquisition of animal healthcare business. Kwality Pharmaceuticals: The company has received approval from Brazil's National Health Surveillance Agency ANVISA (Agencia Nacional de Vigilancia Sanitaria) for its injectable formulations manufacturing unit at Amritsar and oncology injectable unit at Himachal Pradesh. The approval allows company to market its products in Brazilian pharmaceutical market. Fund Flow FII and DII data Foreign institutional investors (FIIs) sold shares worth Rs 1,119.11 crore, while domestic institutional investors (DIIs) purchased shares worth Rs 1,757.37 crore on December 21, as per provisional data available on the NSE. Stocks under F&O ban on NSE The National Stock Exchange has retained GNFC, Indiabulls Housing Finance, and IRCTC under its F&O ban list for December 22. Securities thus banned under the F&O segment include companies where derivative contracts have crossed 95 percent of the market-wide position limit.", "date": "2022-12-22", "resolved_text": " The market extended losses to settle at a one-month low on December 21 amid a surge in COVID-19 cases globally. That apart, fear of recession and selling by FIIs, too, put pressure on The market. All sectors, barring pharma and IT, closed in the red. The BSE Sensex plunged 635 points or 1 percent to 61,067, while the Nifty50 plummeted 186 points to 18,199 and formed a Bearish Engulfing candle pattern on the daily charts, indicating more weakness in The market going ahead. \"On the daily charts, the Nifty50 formed a Bearish Engulfing candle pattern which is a bearish reversal pattern. However, the Nifty50 managed to sustain above important support of 18,130 level,\" Vidnyan Sawant, AVP - Technical Research at GEPL Capital said. The momentum indicator RSI (relative strength index) is moving below the 45 level which indicates a lack of momentum of the Nifty50. the Nifty50 has an immediate resistance level placed at 18,300 (key resistance) followed by 18,440 (multiple touch point) and on the other side, the Nifty50 has a strong support level placed at 18,130 (key support) followed by 17,959 (key support). As per the overall price structure and evidence provided by indicators, Vidnyan Sawant, AVP - Technical Research at GEPL Capital feels that the Nifty50 will move towards 18,130 followed by 17,959 levels. If the Nifty50 sustains above the 18,545 level then the corrective view will be negated, Vidnyan Sawant, AVP - Technical Research at GEPL Capital said. The broader markets saw more correction than benchmarks on weak breadth. The Nifty Midcap 100 index tanked 1.6 percent while the Smallcap 100 index slumped 2.2 percent as nearly six shares declined for every one advancing share on the Nifty50. The volatility also increased sharply, hence making the bulls uncomfortable. India VIX, the fear index, rose by 12.93 percent to 15.56 levels. We have collated 15 data points to help you spot profitable trades: Note: The open interest (OI) and volume data of stocks in this article are the aggregates of three-month data, and not just of the current month. Key support and resistance levels on the Nifty50 As per the pivot charts, the key support level for the Nifty50 is placed at 18,160, followed by 18,086 & 17,968. If the Nifty50 moves up, the key resistance levels to watch out for are 18,397 followed by 18,470 and 18,589. Nifty Bank Nifty Bank also saw major selling pressure and has broken the crucial support of the 43,000 mark. The banking index fell 742 points to close at 42,618 and formed a Bearish Engulfing candlestick pattern on the daily charts. The important pivot level, which will act as crucial support for The banking index, is placed at 42,388, followed by 42,092 and 41,615 levels. On the upside, key resistance levels are placed at 43,343 followed by 43,638 & 44,116 levels. CALL OPTION DATA We have seen the maximum Call open interest at 18,500 strike, with 51.31 lakh contracts, which can act as a crucial resistance level in the December series. the maximum Call open interest at 18,500 strike, with 51.31 lakh contracts, which can act as a crucial resistance level in the December series is followed by 19,000 strike, which holds 37.14 lakh contracts, and 18,600 strike, which have more than 35.54 lakh contracts. Call writing was seen at 18,500 strike, which added 14.83 lakh contracts, followed by 18,600 strike, which added 6.53 lakh contracts, and 18,200 strike which added 5.37 lakh contracts. Call unwinding was seen at 18,800 strike, which shed 2.22 lakh contracts, followed by 19,200 strike which shed 1.25 lakh contracts and 19,600 strike which shed 50,200 contracts. PUT OPTION DATA We have seen a maximum Put open interest at 18,000 strike, with 47.84 lakh contracts which can act as a crucial support level in the December series. a maximum Put open interest at 18,000 strike, with 47.84 lakh contracts which can act as a crucial support level in the December series is followed by an 18,300 strike, which holds 36.06 lakh contracts, and a 17,500 strike, which has accumulated 32.17 lakh contracts. Put writing was seen at 18,000 strike, which added 6.25 lakh contracts, followed by 17,800 strike, which added 4.82 lakh contracts and 18,100 strike which added 2.44 lakh contracts. Put unwinding was seen at 18,300 strike, which shed 6.43 lakh contracts, followed by 18,400 strike which shed 2.66 lakh contracts, and 18,700 strike which shed 49,950 contracts. Stocks with a high delivery percentage A high delivery percentage suggests that investors are showing interest in Stocks with a high delivery percentage. We have seen the highest delivery in Torrent Pharma, Oracle Financial, Voltas, Samvardhana Motherson International, and Infosys, among others. 9 stocks saw long build-up An increase in open interest, along with an increase in price, mostly indicates a build-up of long positions. Based on the open interest future percentage, we have seen a long build-up in the total of nine stocks on Wednesday, including Torrent Pharma, Ipca Laboratories, Glenmark Pharma, Cipla, and Dr Lal PathLabs. 94 stocks saw long unwinding A decline in open interest, along with a decrease in price, mostly indicates a long unwinding. Based on the open interest future percentage, 94 stocks have seen long unwinding on Wednesday including Chambal Fertilizers, Dalmia Bharat, Delta Corp, Punjab National Bank, and Persistent Systems. 63 stocks saw short build-up An increase in open interest, along with a decrease in price, mostly indicates a build-up of short positions. Based on the open interest future percentage, we have seen a short build-up in a total of 63 stocks on Wednesday including LIC Housing Finance, Max Financial Services, Nifty Financial, City Union Bank, and Dixon Technologies. 29 stocks witnessed short-covering A decrease in open interest, along with an increase in price, mostly indicates a short-covering. Based on the open interest future percentage, we have a total of 29 stocks in the short-covering list on Wednesday including Metropolis Healthcare, LTIMindtree, Syngene International, Biocon, and Lupin. Bulk Deals D-Link India: Ace investor Ashish Kacholia sold 2.13 lakh shares (0.6 percent) in Ace via open market transactions, at an average price of Rs 242.56 per share. Ace investor Ashish Kacholia had held a 3.34 percent stake or 11.86 lakh shares in Ace as of September 2022. Max Financial Services: Max Ventures Investment Holdings The stake sale 58.85 lakh shares (1.7 percent) in Ace via open market transactions at an average price of Rs 679.2 per share. The stake sale was worth Rs 400 crore. (For more bulk deals, click here) Investors Meetings on December 22 Greaves Cotton: Officials of company will interact with HDFC Securities. Tata Motors: Officials of Tata Motors will interact with Aspex Management (HK), Motilal Oswal Mutual, and HDFC MF. Blue Star: Officials of Tata Motors will interact with ICICI Prudential AMC. Havells India, Kaynes Technology India: Officials of companies will participate in PhillipCapital \"Manufacturing Day - From Make-in-India to Make-For-The-World\" in Delhi. Tata Consumer Products: Officials of Tata Consumer Products will interact with GIC. CE Info Systems: Officials of Tata Consumer Products will interact with LIC MF. CARE Ratings: Officials of Tata Consumer Products will interact with O3 Capital, and Securities Investment Management. Indian Bank: Officials of Indian Bank will interact with analysts and investors. Polycab India: Officials of Polycab India will interact with Macquarie Capital. Sapphire Foods India: Officials of Sapphire Foods India will interact with Nuvama (Edelweiss), Hara Global Capital Management, Ambit Capital, and HDFC Securities. Ircon International: Management of Sapphire Foods India will meet Grace Yan, Portfolio Manager at Nikko Asset Management. Stocks in News Sula Vineyards: India's largest wine producer will make India's largest wine producer's debut on the bourses on December 22. The issue price has been fixed at Rs 357 per share. JMC Projects (India): The National Company Law Tribunal has sanctioned the Scheme of Amalgamation of India's largest wine producer with Kalpataru Power Transmission. Speciality Restaurants: India's largest wine producer has received board approval for issue of 60 lakh warrants convertible into equity shares on preferential basis, at a price of Rs 212.05 per warrant. An amount equivalent to 25% of the warrant issue price (i.e. Rs 53.02 per warrant) will be payable at the time of subscription and allotment of each warrant, and the balance 75% of the warrant issue price (Rs 159.03 per warrant) will be payable on the exercise of warrants on or before April 30, 2023. JB Chemicals & Pharmaceuticals: JB Chemicals & Pharmaceuticals has completed acquisition of Razel franchise from Glenmark Pharmaceuticals. Last week, As a result, JB Chemicals & Pharmaceuticals had agreed to acquire Glenmark Pharmaceuticals's cardiac brand Razel in India and Nepal for Rs 313.7 crore. Supriya Lifescience: Supriya Lifescience has signed an agreement with Pune-based Enrich Energy to develop 4.68 MWp DC solar photovoltaic power project at Nanded in Maharashtra. 4.68 MWp DC solar photovoltaic power project will generate & supply green energy to fulfill about 50 percent present consumption of Supriya Lifescience & reduce carbon emission equivalent to 6,830 tons per annum. Lyka Labs: Lyka Labs has signed an agreement to acquire animal healthcare business from Agilis Healthcare. In November, Lyka Labs had proposed acquisition of animal healthcare business. Kwality Pharmaceuticals: Kwality Pharmaceuticals has received approval from Brazil's National Health Surveillance Agency ANVISA (Agencia Nacional de Vigilancia Sanitaria) for Brazil's National Health Surveillance Agency ANVISA (Agencia Nacional de Vigilancia Sanitaria)'s injectable formulations manufacturing unit at Amritsar and oncology injectable unit at Himachal Pradesh. approval from Brazil's National Health Surveillance Agency ANVISA (Agencia Nacional de Vigilancia Sanitaria) allows Brazil's National Health Surveillance Agency ANVISA (Agencia Nacional de Vigilancia Sanitaria) to market Brazil's National Health Surveillance Agency ANVISA (Agencia Nacional de Vigilancia Sanitaria)'s products in Brazilian pharmaceutical market. Fund Flow FII and DII data Foreign institutional investors (FIIs) sold shares worth Rs 1,119.11 crore, while domestic institutional investors (DIIs) purchased shares worth Rs 1,757.37 crore on December 21, as per provisional data available on the Nifty50. Stocks under F&O ban on the Nifty50 the Nifty50 has retained GNFC, Indiabulls Housing Finance, and IRCTC under the Nifty50's F&O ban list for December 22. Securities thus banned under the F&O segment include companies where derivative contracts have crossed 95 percent of the market-wide position limit.", "sentiment_score": -1.0, "sentiment_class": "Negative", "sentiment_class_value": -2}, {"_id": {"$oid": "63af4e0ca196a33fd1a316b5"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-nifty-it-index-flat-0-0/articleshow/96425392.cms", "title": "Stock market update: Nifty IT index flat 0.0%", "datetime": "2022-12-22 16:10", "content": "NEW DELHI: The Nifty IT index closed on a note on Thursday. Shares of MPhasis(up 1.52 per cent) and Infosys(up 0.83 per cent) ended the day as top gainers in the pack. On the other hand, LTIMindtree Ltd(down 1.03 per cent), Tech Mahindra(down 0.99 per cent), Coforge(down 0.89 per cent), Persistent Systems(down 0.29 per cent) and Tata Consultancy(down 0.27 per cent) finished as the top losers of the day. The Nifty IT index closed 0.0 per cent at 28763.9. Benchmark NSE Nifty50 index ended down 71.75 points at 18127.35, while the BSE Sensex stood down 241.02 points at 60826.22. Among the 50 stocks in the Nifty index, 10 ended in the green, while 39 closed in the red. Shares of , , PNB, and were among the most traded shares on the NSE. Shares of., , , and hit their fresh 52-week highs in today's trade, while Ishan International Ltd., Ameya Precision Engineers Ltd., Amiable Logistic(India)Ltd., Dharmaj Crop Guard Ltd. and Sula Vineyards Ltd. hit their fresh 52-week lows. ", "date": "2022-12-22", "resolved_text": "NEW DELHI: The Nifty IT index closed on a note on Thursday. Shares of MPhasis(up 1.52 per cent) and Infosys(up 0.83 per cent) ended Thursday as top gainers in the pack. On the other hand, LTIMindtree Ltd(down 1.03 per cent), Tech Mahindra(down 0.99 per cent), Coforge(down 0.89 per cent), Persistent Systems(down 0.29 per cent) and Tata Consultancy(down 0.27 per cent) finished as the top losers of Thursday. The Nifty IT index closed 0.0 per cent at 28763.9. Benchmark NSE Nifty50 index ended down 71.75 points at 18127.35, while the BSE Sensex stood down 241.02 points at 60826.22. Among the 50 stocks in The Nifty IT index, 10 ended in the green, while 39 closed in the red. Shares of , , PNB, and were among the most traded shares on NSE. Shares of., , , and hit Shares of., , , and's fresh 52-week highs in today's trade, while Ishan International Ltd., Ameya Precision Engineers Ltd., Amiable Logistic(India)Ltd., Dharmaj Crop Guard Ltd. and Sula Vineyards Ltd. hit their fresh 52-week lows. ", "sentiment_score": 0.0, "sentiment_class": "Neutral", "sentiment_class_value": 0}, {"_id": {"$oid": "63af4e0d37c41e98a354043e"}, "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-nifty-it-index-advances-0-17-in-a-weak-market/articleshow/96417204.cms", "title": "Stock market update: Nifty IT index advances 0.17% in a weak market", "datetime": "2022-12-22 11:15", "content": "NEW DELHI: The Nifty IT index traded positive around 11:15AM(IST)on Thursday in a weak market. Infosys(up 1.12 per cent), MPhasis(up 1.0 per cent) and Persistent Systems(up 0.67 per cent) were among the top gainers. Coforge(down 1.08 per cent), Tech Mahindra(down 0.54 per cent), Wipro(down 0.49 per cent), LTIMindtree Ltd(down 0.43 per cent) and HCL Technologies(down 0.3 per cent) were the top losers on the index. The Nifty IT index was up 0.17 per cent at 28813.65 at the time of writing this report. Benchmark NSE Nifty50 index was down 59.4 points at 18139.7, while the BSE Sensex was down 170.46 points at 60896.78. Among the 50 stocks in the Nifty index, 10 were trading in the green, while 40 were in the red. Shares of , , PNB, IOB and were among the most traded shares on the NSE. Shares of , , Vasa Retail & Overse, and hit their fresh 52-week highs in today's trade, while Ameya Precision Engineers Ltd., Ishan International Ltd., ,. and hit fresh 52-week lows in trade. ", "date": "2022-12-22", "resolved_text": "NEW DELHI: The Nifty IT index traded positive around 11:15AM(IST)on Thursday in a weak market. Infosys(up 1.12 per cent), MPhasis(up 1.0 per cent) and Persistent Systems(up 0.67 per cent) were among the top gainers. Coforge(down 1.08 per cent), Tech Mahindra(down 0.54 per cent), Wipro(down 0.49 per cent), LTIMindtree Ltd(down 0.43 per cent) and HCL Technologies(down 0.3 per cent) were the top losers on The Nifty IT index. The Nifty IT index was up 0.17 per cent at 28813.65 at the time of writing this report. Benchmark NSE Nifty50 index was down 59.4 points at 18139.7, while the BSE Sensex was down 170.46 points at 60896.78. Among the 50 stocks in The Nifty IT index, 10 were trading in the green, while 40 were in the red. Shares of , , PNB, IOB and were among the most traded shares on NSE. Shares of , , Vasa Retail & Overse, and hit Shares of , , Vasa Retail & Overse, and's fresh 52-week highs in today's trade, while Ameya Precision Engineers Ltd., Ishan International Ltd., ,. and hit fresh 52-week lows in trade. ", "sentiment_score": 0.0, "sentiment_class": "Neutral", "sentiment_class_value": 0}]}}